<abi-corpus version='2.4' path='libpython3.6m.so' soname='libpython3.6m.so.1.0'>
  <elf-needed>
    <dependency name='libm.so.6'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='PyAST_Check' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Compile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileEx' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_CompileObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_FromNodeObject' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_Validate' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_mod2obj' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='PyAST_obj2mod' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='textdomain' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='time' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='times' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='truncate64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ttyname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='tzset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='umask' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='ungetc' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unlink' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unlinkat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='unsetenv' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='utimensat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wait' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wait3' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wait4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='waitid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='waitpid' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcschr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscoll' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcscpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsftime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcslen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsncat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcstok' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcstombs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wcsxfrm' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='wmemcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='writev' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_environ' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='environ' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stderr' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdin' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='stdout' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='./Modules/_codecsmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__stack_chk_fail' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='_frame' is-struct='yes' visibility='default' size-in-bits='3072' filepath='./Include/frameobject.h' line='17' column='1' hash='f5fb04afe2b77f5d' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-3' visibility='default' filepath='./Include/frameobject.h' line='18' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='f_back' type-id='type-id-4' visibility='default' filepath='./Include/frameobject.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='f_code' type-id='type-id-5' visibility='default' filepath='./Include/frameobject.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='f_builtins' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='f_globals' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='f_locals' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='23' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='f_valuestack' type-id='type-id-7' visibility='default' filepath='./Include/frameobject.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='f_stacktop' type-id='type-id-7' visibility='default' filepath='./Include/frameobject.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='f_trace' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='f_exc_type' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='f_exc_value' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='f_exc_traceback' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='f_gen' type-id='type-id-6' visibility='default' filepath='./Include/frameobject.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='f_lasti' type-id='type-id-8' visibility='default' filepath='./Include/frameobject.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='f_lineno' type-id='type-id-8' visibility='default' filepath='./Include/frameobject.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='f_iblock' type-id='type-id-8' visibility='default' filepath='./Include/frameobject.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='f_executing' type-id='type-id-9' visibility='default' filepath='./Include/frameobject.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='f_blockstack' type-id='type-id-10' visibility='default' filepath='./Include/frameobject.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='f_localsplus' type-id='type-id-11' visibility='default' filepath='./Include/frameobject.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <var-decl name='PyFilter_Type' type-id='type-id-12' visibility='default' filepath='./Include/bltinmodule.h' line='7' column='1'/>
    <var-decl name='PyMap_Type' type-id='type-id-12' visibility='default' filepath='./Include/bltinmodule.h' line='8' column='1'/>
    <var-decl name='PyZip_Type' type-id='type-id-12' visibility='default' filepath='./Include/bltinmodule.h' line='9' column='1'/>
    <var-decl name='PyBool_Type' type-id='type-id-12' visibility='default' filepath='./Include/boolobject.h' line='10' column='1'/>
    <var-decl name='_Py_FalseStruct' type-id='type-id-13' visibility='default' filepath='./Include/boolobject.h' line='18' column='1'/>
    <var-decl name='_Py_TrueStruct' type-id='type-id-13' visibility='default' filepath='./Include/boolobject.h' line='18' column='1'/>
    <var-decl name='PyByteArray_Type' type-id='type-id-12' visibility='default' filepath='./Include/bytearrayobject.h' line='34' column='1'/>
    <var-decl name='PyByteArrayIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/bytearrayobject.h' line='35' column='1'/>
    <var-decl name='_PyByteArray_empty_string' type-id='type-id-14' visibility='default' filepath='./Include/bytearrayobject.h' line='56' column='1'/>
    <var-decl name='PyBytes_Type' type-id='type-id-12' visibility='default' filepath='./Include/bytesobject.h' line='44' column='1'/>
    <var-decl name='PyBytesIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/bytesobject.h' line='45' column='1'/>
    <var-decl name='PyCell_Type' type-id='type-id-12' visibility='default' filepath='./Include/cellobject.h' line='14' column='1'/>
    <var-decl name='_Py_CheckRecursionLimit' type-id='type-id-8' visibility='default' filepath='./Include/ceval.h' line='90' column='1'/>
    <var-decl name='PyMethod_Type' type-id='type-id-12' visibility='default' filepath='./Include/classobject.h' line='19' column='1'/>
    <var-decl name='PyInstanceMethod_Type' type-id='type-id-12' visibility='default' filepath='./Include/classobject.h' line='42' column='1'/>
    <var-decl name='PyCode_Type' type-id='type-id-12' visibility='default' filepath='./Include/code.h' line='98' column='1'/>
    <var-decl name='Py_hexdigits' type-id='type-id-15' visibility='default' filepath='./Include/codecs.h' line='234' column='1'/>
    <var-decl name='PyComplex_Type' type-id='type-id-12' visibility='default' filepath='./Include/complexobject.h' line='39' column='1'/>
    <var-decl name='PyClassMethodDescr_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='75' column='1'/>
    <var-decl name='PyGetSetDescr_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='76' column='1'/>
    <var-decl name='PyMemberDescr_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='77' column='1'/>
    <var-decl name='PyMethodDescr_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='78' column='1'/>
    <var-decl name='PyWrapperDescr_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='79' column='1'/>
    <var-decl name='PyDictProxy_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='80' column='1'/>
    <var-decl name='_PyMethodWrapper_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='82' column='1'/>
    <var-decl name='PyProperty_Type' type-id='type-id-12' visibility='default' filepath='./Include/descrobject.h' line='102' column='1'/>
    <var-decl name='PyDict_Type' type-id='type-id-12' visibility='default' filepath='./Include/dictobject.h' line='50' column='1'/>
    <var-decl name='PyDictIterKey_Type' type-id='type-id-12' visibility='default' filepath='./Include/dictobject.h' line='51' column='1'/>
    <var-decl name='PyDictIterValue_Type' type-id='type-id-12' visibility='default' filepath='./Include/dictobject.h' line='52' column='1'/>
    <var-decl name='PyDictIterItem_Type' type-id='type-id-12' visibility='default' filepath='./Include/dictobject.h' line='53' column='1'/>
    <var-decl name='PyDictKeys_Type' type-id='type-id-12' visibility='default' filepath='./Include/dictobject.h' line='54' column='1'/>
    <var-decl name='PyDictItems_Type' type-id='type-id-12' visibility='default' filepath='./Include/dictobject.h' line='55' column='1'/>
    <var-decl name='PyDictValues_Type' type-id='type-id-12' visibility='default' filepath='./Include/dictobject.h' line='56' column='1'/>
    <var-decl name='PyEnum_Type' type-id='type-id-12' visibility='default' filepath='./Include/enumobject.h' line='10' column='1'/>
    <var-decl name='PyReversed_Type' type-id='type-id-12' visibility='default' filepath='./Include/enumobject.h' line='11' column='1'/>
    <var-decl name='Py_FileSystemDefaultEncoding' type-id='type-id-15' visibility='default' filepath='./Include/fileobject.h' line='25' column='1'/>
    <var-decl name='Py_FileSystemDefaultEncodeErrors' type-id='type-id-15' visibility='default' filepath='./Include/fileobject.h' line='27' column='1'/>
    <var-decl name='Py_HasFileSystemDefaultEncoding' type-id='type-id-8' visibility='default' filepath='./Include/fileobject.h' line='29' column='1'/>
    <var-decl name='PyStdPrinter_Type' type-id='type-id-12' visibility='default' filepath='./Include/fileobject.h' line='37' column='1'/>
    <var-decl name='PyFloat_Type' type-id='type-id-12' visibility='default' filepath='./Include/floatobject.h' line='21' column='1'/>
    <var-decl name='PyFunction_Type' type-id='type-id-12' visibility='default' filepath='./Include/funcobject.h' line='43' column='1'/>
    <var-decl name='PyClassMethod_Type' type-id='type-id-12' visibility='default' filepath='./Include/funcobject.h' line='93' column='1'/>
    <var-decl name='PyStaticMethod_Type' type-id='type-id-12' visibility='default' filepath='./Include/funcobject.h' line='94' column='1'/>
    <var-decl name='PyGen_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='35' column='1'/>
    <var-decl name='PyCoro_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='55' column='1'/>
    <var-decl name='_PyCoroWrapper_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='56' column='1'/>
    <var-decl name='_PyAIterWrapper_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='58' column='1'/>
    <var-decl name='PyAsyncGen_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='82' column='1'/>
    <var-decl name='_PyAsyncGenASend_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='83' column='1'/>
    <var-decl name='_PyAsyncGenWrappedValue_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='84' column='1'/>
    <var-decl name='_PyAsyncGenAThrow_Type' type-id='type-id-12' visibility='default' filepath='./Include/genobject.h' line='85' column='1'/>
    <var-decl name='PyImport_Inittab' type-id='type-id-16' visibility='default' filepath='./Include/import.h' line='113' column='1'/>
    <var-decl name='PyNullImporter_Type' type-id='type-id-12' visibility='default' filepath='./Include/import.h' line='117' column='1'/>
    <var-decl name='PyImport_FrozenModules' type-id='type-id-17' visibility='default' filepath='./Include/import.h' line='134' column='1'/>
    <var-decl name='PySeqIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/iterobject.h' line='8' column='1'/>
    <var-decl name='PyCallIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/iterobject.h' line='9' column='1'/>
    <var-decl name='PyCmpWrapper_Type' type-id='type-id-12' visibility='default' filepath='./Include/iterobject.h' line='10' column='1'/>
    <var-decl name='PyList_Type' type-id='type-id-12' visibility='default' filepath='./Include/listobject.h' line='43' column='1'/>
    <var-decl name='PyListIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/listobject.h' line='44' column='1'/>
    <var-decl name='PyListRevIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/listobject.h' line='45' column='1'/>
    <var-decl name='PySortWrapper_Type' type-id='type-id-12' visibility='default' filepath='./Include/listobject.h' line='46' column='1'/>
    <var-decl name='PyLong_Type' type-id='type-id-12' visibility='default' filepath='./Include/longobject.h' line='12' column='1'/>
    <var-decl name='_PyLong_DigitValue' type-id='type-id-18' visibility='default' filepath='./Include/longobject.h' line='71' column='1'/>
    <var-decl name='_PyManagedBuffer_Type' type-id='type-id-12' visibility='default' filepath='./Include/memoryobject.h' line='10' column='1'/>
    <var-decl name='PyMemoryView_Type' type-id='type-id-12' visibility='default' filepath='./Include/memoryobject.h' line='12' column='1'/>
    <var-decl name='PyCFunction_Type' type-id='type-id-12' visibility='default' filepath='./Include/methodobject.h' line='14' column='1'/>
    <var-decl name='_Py_PackageContext' type-id='type-id-19' visibility='default' filepath='./Include/modsupport.h' line='185' column='1'/>
    <var-decl name='PyModule_Type' type-id='type-id-12' visibility='default' filepath='./Include/moduleobject.h' line='10' column='1'/>
    <var-decl name='PyModuleDef_Type' type-id='type-id-12' visibility='default' filepath='./Include/moduleobject.h' line='40' column='1'/>
    <var-decl name='_PyNamespace_Type' type-id='type-id-12' visibility='default' filepath='./Include/namespaceobject.h' line='11' column='1'/>
    <var-decl name='PyType_Type' type-id='type-id-12' visibility='default' filepath='./Include/object.h' line='489' column='1'/>
    <var-decl name='PyBaseObject_Type' type-id='type-id-12' visibility='default' filepath='./Include/object.h' line='490' column='1'/>
    <var-decl name='PySuper_Type' type-id='type-id-12' visibility='default' filepath='./Include/object.h' line='491' column='1'/>
    <var-decl name='_PyNone_Type' type-id='type-id-12' visibility='default' filepath='./Include/object.h' line='900' column='1'/>
    <var-decl name='_PyNotImplemented_Type' type-id='type-id-12' visibility='default' filepath='./Include/object.h' line='901' column='1'/>
    <var-decl name='_Py_NoneStruct' type-id='type-id-20' visibility='default' filepath='./Include/object.h' line='910' column='1'/>
    <var-decl name='_Py_NotImplementedStruct' type-id='type-id-20' visibility='default' filepath='./Include/object.h' line='920' column='1'/>
    <var-decl name='_Py_SwappedOp' type-id='type-id-21' visibility='default' filepath='./Include/object.h' line='939' column='1'/>
    <var-decl name='_PyTrash_delete_nesting' type-id='type-id-8' visibility='default' filepath='./Include/object.h' line='1042' column='1'/>
    <var-decl name='_PyTrash_delete_later' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='1043' column='1'/>
    <var-decl name='_PyGC_generation0' type-id='type-id-22' visibility='default' filepath='./Include/objimpl.h' line='261' column='1'/>
    <var-decl name='PyODict_Type' type-id='type-id-12' visibility='default' filepath='./Include/odictobject.h' line='15' column='1'/>
    <var-decl name='PyODictIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/odictobject.h' line='16' column='1'/>
    <var-decl name='PyODictKeys_Type' type-id='type-id-12' visibility='default' filepath='./Include/odictobject.h' line='17' column='1'/>
    <var-decl name='PyODictItems_Type' type-id='type-id-12' visibility='default' filepath='./Include/odictobject.h' line='18' column='1'/>
    <var-decl name='PyODictValues_Type' type-id='type-id-12' visibility='default' filepath='./Include/odictobject.h' line='19' column='1'/>
    <var-decl name='PyCapsule_Type' type-id='type-id-12' visibility='default' filepath='./Include/pycapsule.h' line='21' column='1'/>
    <var-decl name='_Py_ctype_table' type-id='type-id-23' visibility='default' filepath='./Include/pyctype.h' line='13' column='1'/>
    <var-decl name='_Py_ctype_tolower' type-id='type-id-24' visibility='default' filepath='./Include/pyctype.h' line='26' column='1'/>
    <var-decl name='_Py_ctype_toupper' type-id='type-id-24' visibility='default' filepath='./Include/pyctype.h' line='27' column='1'/>
    <var-decl name='Py_DebugFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='10' column='1'/>
    <var-decl name='Py_VerboseFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='11' column='1'/>
    <var-decl name='Py_QuietFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='12' column='1'/>
    <var-decl name='Py_InteractiveFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='13' column='1'/>
    <var-decl name='Py_InspectFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='14' column='1'/>
    <var-decl name='Py_OptimizeFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='15' column='1'/>
    <var-decl name='Py_NoSiteFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='16' column='1'/>
    <var-decl name='Py_BytesWarningFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='17' column='1'/>
    <var-decl name='Py_UseClassExceptionsFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='18' column='1'/>
    <var-decl name='Py_FrozenFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='19' column='1'/>
    <var-decl name='Py_IgnoreEnvironmentFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='20' column='1'/>
    <var-decl name='Py_DontWriteBytecodeFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='21' column='1'/>
    <var-decl name='Py_NoUserSiteDirectory' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='22' column='1'/>
    <var-decl name='Py_UnbufferedStdioFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='23' column='1'/>
    <var-decl name='Py_HashRandomizationFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='24' column='1'/>
    <var-decl name='Py_IsolatedFlag' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='25' column='1'/>
    <var-decl name='_Py_global_config_int_max_str_digits' type-id='type-id-8' visibility='default' filepath='./Include/pydebug.h' line='31' column='1'/>
    <var-decl name='PyExc_BaseException' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='150' column='1'/>
    <var-decl name='PyExc_Exception' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='151' column='1'/>
    <var-decl name='PyExc_StopAsyncIteration' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='153' column='1'/>
    <var-decl name='PyExc_StopIteration' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='155' column='1'/>
    <var-decl name='PyExc_GeneratorExit' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='156' column='1'/>
    <var-decl name='PyExc_ArithmeticError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='157' column='1'/>
    <var-decl name='PyExc_LookupError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='158' column='1'/>
    <var-decl name='PyExc_AssertionError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='160' column='1'/>
    <var-decl name='PyExc_AttributeError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='161' column='1'/>
    <var-decl name='PyExc_BufferError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='162' column='1'/>
    <var-decl name='PyExc_EOFError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='163' column='1'/>
    <var-decl name='PyExc_FloatingPointError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='164' column='1'/>
    <var-decl name='PyExc_OSError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='165' column='1'/>
    <var-decl name='PyExc_ImportError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='166' column='1'/>
    <var-decl name='PyExc_ModuleNotFoundError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='168' column='1'/>
    <var-decl name='PyExc_IndexError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='170' column='1'/>
    <var-decl name='PyExc_KeyError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='171' column='1'/>
    <var-decl name='PyExc_KeyboardInterrupt' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='172' column='1'/>
    <var-decl name='PyExc_MemoryError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='173' column='1'/>
    <var-decl name='PyExc_NameError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='174' column='1'/>
    <var-decl name='PyExc_OverflowError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='175' column='1'/>
    <var-decl name='PyExc_RuntimeError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='176' column='1'/>
    <var-decl name='PyExc_RecursionError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='178' column='1'/>
    <var-decl name='PyExc_NotImplementedError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='180' column='1'/>
    <var-decl name='PyExc_SyntaxError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='181' column='1'/>
    <var-decl name='PyExc_IndentationError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='182' column='1'/>
    <var-decl name='PyExc_TabError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='183' column='1'/>
    <var-decl name='PyExc_ReferenceError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='184' column='1'/>
    <var-decl name='PyExc_SystemError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='185' column='1'/>
    <var-decl name='PyExc_SystemExit' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='186' column='1'/>
    <var-decl name='PyExc_TypeError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='187' column='1'/>
    <var-decl name='PyExc_UnboundLocalError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='188' column='1'/>
    <var-decl name='PyExc_UnicodeError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='189' column='1'/>
    <var-decl name='PyExc_UnicodeEncodeError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='190' column='1'/>
    <var-decl name='PyExc_UnicodeDecodeError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='191' column='1'/>
    <var-decl name='PyExc_UnicodeTranslateError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='192' column='1'/>
    <var-decl name='PyExc_ValueError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='193' column='1'/>
    <var-decl name='PyExc_ZeroDivisionError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='194' column='1'/>
    <var-decl name='PyExc_BlockingIOError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='197' column='1'/>
    <var-decl name='PyExc_BrokenPipeError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='198' column='1'/>
    <var-decl name='PyExc_ChildProcessError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='199' column='1'/>
    <var-decl name='PyExc_ConnectionError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='200' column='1'/>
    <var-decl name='PyExc_ConnectionAbortedError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='201' column='1'/>
    <var-decl name='PyExc_ConnectionRefusedError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='202' column='1'/>
    <var-decl name='PyExc_ConnectionResetError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='203' column='1'/>
    <var-decl name='PyExc_FileExistsError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='204' column='1'/>
    <var-decl name='PyExc_FileNotFoundError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='205' column='1'/>
    <var-decl name='PyExc_InterruptedError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='206' column='1'/>
    <var-decl name='PyExc_IsADirectoryError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='207' column='1'/>
    <var-decl name='PyExc_NotADirectoryError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='208' column='1'/>
    <var-decl name='PyExc_PermissionError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='209' column='1'/>
    <var-decl name='PyExc_ProcessLookupError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='210' column='1'/>
    <var-decl name='PyExc_TimeoutError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='211' column='1'/>
    <var-decl name='PyExc_EnvironmentError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='216' column='1'/>
    <var-decl name='PyExc_IOError' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='217' column='1'/>
    <var-decl name='PyExc_Warning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='223' column='1'/>
    <var-decl name='PyExc_UserWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='224' column='1'/>
    <var-decl name='PyExc_DeprecationWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='225' column='1'/>
    <var-decl name='PyExc_PendingDeprecationWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='226' column='1'/>
    <var-decl name='PyExc_SyntaxWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='227' column='1'/>
    <var-decl name='PyExc_RuntimeWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='228' column='1'/>
    <var-decl name='PyExc_FutureWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='229' column='1'/>
    <var-decl name='PyExc_ImportWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='230' column='1'/>
    <var-decl name='PyExc_UnicodeWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='231' column='1'/>
    <var-decl name='PyExc_BytesWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='232' column='1'/>
    <var-decl name='PyExc_ResourceWarning' type-id='type-id-6' visibility='default' filepath='./Include/pyerrors.h' line='233' column='1'/>
    <var-decl name='PyFPE_jbuf' type-id='type-id-25' visibility='default' filepath='./Include/pyfpe.h' line='132' column='1'/>
    <var-decl name='PyFPE_counter' type-id='type-id-8' visibility='default' filepath='./Include/pyfpe.h' line='133' column='1'/>
    <var-decl name='_Py_HashSecret' type-id='type-id-26' visibility='default' filepath='./Include/pyhash.h' line='77' column='1'/>
    <var-decl name='_Py_Finalizing' type-id='type-id-27' visibility='default' filepath='./Include/pylifecycle.h' line='114' column='1'/>
    <var-decl name='_PyThreadState_Current' type-id='type-id-28' visibility='default' filepath='./Include/pystate.h' line='224' column='1'/>
    <var-decl name='_PyGILState_check_enabled' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='281' column='1'/>
    <var-decl name='_PyThreadState_GetFrame' type-id='type-id-29' visibility='default' filepath='./Include/pystate.h' line='319' column='1'/>
    <var-decl name='PyOS_InputHook' type-id='type-id-30' visibility='default' filepath='./Include/pythonrun.h' line='173' column='1'/>
    <var-decl name='PyOS_ReadlineFunctionPointer' type-id='type-id-31' visibility='default' filepath='./Include/pythonrun.h' line='174' column='1'/>
    <var-decl name='_PyOS_ReadlineTState' type-id='type-id-27' visibility='default' filepath='./Include/pythonrun.h' line='176' column='1'/>
    <var-decl name='PyRange_Type' type-id='type-id-12' visibility='default' filepath='./Include/rangeobject.h' line='18' column='1'/>
    <var-decl name='PyRangeIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/rangeobject.h' line='19' column='1'/>
    <var-decl name='PyLongRangeIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/rangeobject.h' line='20' column='1'/>
    <var-decl name='_PySet_Dummy' type-id='type-id-6' visibility='default' filepath='./Include/setobject.h' line='69' column='1'/>
    <var-decl name='PySet_Type' type-id='type-id-12' visibility='default' filepath='./Include/setobject.h' line='77' column='1'/>
    <var-decl name='PyFrozenSet_Type' type-id='type-id-12' visibility='default' filepath='./Include/setobject.h' line='78' column='1'/>
    <var-decl name='PySetIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/setobject.h' line='79' column='1'/>
    <var-decl name='_Py_EllipsisObject' type-id='type-id-20' visibility='default' filepath='./Include/sliceobject.h' line='9' column='1'/>
    <var-decl name='PySlice_Type' type-id='type-id-12' visibility='default' filepath='./Include/sliceobject.h' line='28' column='1'/>
    <var-decl name='PyEllipsis_Type' type-id='type-id-12' visibility='default' filepath='./Include/sliceobject.h' line='29' column='1'/>
    <var-decl name='PyStructSequence_UnnamedField' type-id='type-id-19' visibility='default' filepath='./Include/structseq.h' line='22' column='1'/>
    <var-decl name='PyTraceBack_Type' type-id='type-id-12' visibility='default' filepath='./Include/traceback.h' line='31' column='1'/>
    <var-decl name='PyTuple_Type' type-id='type-id-12' visibility='default' filepath='./Include/tupleobject.h' line='36' column='1'/>
    <var-decl name='PyTupleIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/tupleobject.h' line='37' column='1'/>
    <var-decl name='PyUnicode_Type' type-id='type-id-12' visibility='default' filepath='./Include/unicodeobject.h' line='363' column='1'/>
    <var-decl name='PyUnicodeIter_Type' type-id='type-id-12' visibility='default' filepath='./Include/unicodeobject.h' line='364' column='1'/>
    <var-decl name='_Py_ascii_whitespace' type-id='type-id-32' visibility='default' filepath='./Include/unicodeobject.h' line='2190' column='1'/>
    <var-decl name='_PyWeakref_RefType' type-id='type-id-12' visibility='default' filepath='./Include/weakrefobject.h' line='43' column='1'/>
    <var-decl name='_PyWeakref_ProxyType' type-id='type-id-12' visibility='default' filepath='./Include/weakrefobject.h' line='44' column='1'/>
    <var-decl name='_PyWeakref_CallableProxyType' type-id='type-id-12' visibility='default' filepath='./Include/weakrefobject.h' line='45' column='1'/>
    <function-decl name='PyInit__codecs' mangled-name='PyInit__codecs' filepath='./Modules/_codecsmodule.c' line='1141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__codecs' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='optarg' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/getopt_core.h' line='36' column='1'/>
    <var-decl name='optind' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/getopt_core.h' line='50' column='1'/>
    <var-decl name='opterr' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/getopt_core.h' line='55' column='1'/>
    <var-decl name='optopt' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/getopt_core.h' line='59' column='1'/>
    <var-decl name='program_invocation_name' type-id='type-id-19' visibility='default' filepath='/usr/include/errno.h' line='45' column='1'/>
    <var-decl name='program_invocation_short_name' type-id='type-id-19' visibility='default' filepath='/usr/include/errno.h' line='46' column='1'/>
    <var-decl name='signgam' type-id='type-id-8' visibility='default' filepath='/usr/include/math.h' line='854' column='1'/>
    <var-decl name='stdin' type-id='type-id-33' visibility='default' filepath='/usr/include/stdio.h' line='148' column='1' elf-symbol-id='stdin'/>
    <var-decl name='stdout' type-id='type-id-33' visibility='default' filepath='/usr/include/stdio.h' line='149' column='1' elf-symbol-id='stdout'/>
    <var-decl name='stderr' type-id='type-id-33' visibility='default' filepath='/usr/include/stdio.h' line='150' column='1' elf-symbol-id='stderr'/>
    <var-decl name='__tzname' type-id='type-id-34' visibility='default' filepath='/usr/include/time.h' line='218' column='1'/>
    <var-decl name='__daylight' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='219' column='1'/>
    <var-decl name='__timezone' type-id='type-id-35' visibility='default' filepath='/usr/include/time.h' line='220' column='1'/>
    <var-decl name='tzname' type-id='type-id-34' visibility='default' filepath='/usr/include/time.h' line='225' column='1'/>
    <var-decl name='daylight' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='233' column='1'/>
    <var-decl name='timezone' type-id='type-id-35' visibility='default' filepath='/usr/include/time.h' line='234' column='1'/>
    <var-decl name='getdate_err' type-id='type-id-8' visibility='default' filepath='/usr/include/time.h' line='426' column='1'/>
    <var-decl name='__environ' type-id='type-id-36' visibility='default' filepath='/usr/include/unistd.h' line='564' column='1' elf-symbol-id='__environ'/>
    <var-decl name='environ' type-id='type-id-36' visibility='default' filepath='/usr/include/unistd.h' line='566' column='1' elf-symbol-id='environ'/>
    <function-type size-in-bits='64' hash='037d575bc520db4e' id='type-id-37'>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='c0a71327ee53fe1d' id='type-id-38'>
      <parameter type-id='type-id-27'/>
      <return type-id='type-id-4'/>
    </function-type>
    <function-type size-in-bits='64' hash='2cd46b4c91c472b2' id='type-id-39'>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-19'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-40'>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-41'>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_collectionsmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit__collections' mangled-name='PyInit__collections' filepath='./Modules/_collectionsmodule.c' line='2399' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__collections' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_functoolsmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit__functools' mangled-name='PyInit__functools' filepath='./Modules/_functoolsmodule.c' line='1246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__functools' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/_iomodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <class-decl name='_PyIO_State' is-struct='yes' naming-typedef-id='type-id-42' visibility='default' size-in-bits='192' filepath='./Modules/_io/_iomodule.h' line='142' column='1' hash='f55e2bf873e3844a' id='type-id-43'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='initialized' type-id='type-id-8' visibility='default' filepath='./Modules/_io/_iomodule.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='locale_module' type-id='type-id-6' visibility='default' filepath='./Modules/_io/_iomodule.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='unsupported_operation' type-id='type-id-6' visibility='default' filepath='./Modules/_io/_iomodule.h' line='146' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Py_off_t' type-id='type-id-44' size-in-bits='64' filepath='./Modules/_io/_iomodule.h' line='106' column='1' hash='b119fe0931d2ee10' id='type-id-45'/>
    <typedef-decl name='_PyIO_State' type-id='type-id-43' size-in-bits='192' filepath='./Modules/_io/_iomodule.h' line='147' column='1' id='type-id-42'/>
    <typedef-decl name='off_t' type-id='type-id-46' size-in-bits='64' filepath='/usr/include/stdio.h' line='65' column='1' hash='b119fe0931d2ee10' id='type-id-44'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' hash='0f723dac149497a2' id='type-id-47'/>
    <var-decl name='_PyIO_str_close' type-id='type-id-6' mangled-name='_PyIO_str_close' visibility='default' filepath='./Modules/_io/_iomodule.c' line='29' column='1' elf-symbol-id='_PyIO_str_close'/>
    <var-decl name='_PyIO_str_closed' type-id='type-id-6' mangled-name='_PyIO_str_closed' visibility='default' filepath='./Modules/_io/_iomodule.c' line='30' column='1' elf-symbol-id='_PyIO_str_closed'/>
    <var-decl name='_PyIO_str_decode' type-id='type-id-6' mangled-name='_PyIO_str_decode' visibility='default' filepath='./Modules/_io/_iomodule.c' line='31' column='1' elf-symbol-id='_PyIO_str_decode'/>
    <var-decl name='_PyIO_str_encode' type-id='type-id-6' mangled-name='_PyIO_str_encode' visibility='default' filepath='./Modules/_io/_iomodule.c' line='32' column='1' elf-symbol-id='_PyIO_str_encode'/>
    <var-decl name='_PyIO_str_fileno' type-id='type-id-6' mangled-name='_PyIO_str_fileno' visibility='default' filepath='./Modules/_io/_iomodule.c' line='33' column='1' elf-symbol-id='_PyIO_str_fileno'/>
    <var-decl name='_PyIO_str_flush' type-id='type-id-6' mangled-name='_PyIO_str_flush' visibility='default' filepath='./Modules/_io/_iomodule.c' line='34' column='1' elf-symbol-id='_PyIO_str_flush'/>
    <var-decl name='_PyIO_str_getstate' type-id='type-id-6' mangled-name='_PyIO_str_getstate' visibility='default' filepath='./Modules/_io/_iomodule.c' line='35' column='1' elf-symbol-id='_PyIO_str_getstate'/>
    <var-decl name='_PyIO_str_isatty' type-id='type-id-6' mangled-name='_PyIO_str_isatty' visibility='default' filepath='./Modules/_io/_iomodule.c' line='36' column='1' elf-symbol-id='_PyIO_str_isatty'/>
    <var-decl name='_PyIO_str_newlines' type-id='type-id-6' mangled-name='_PyIO_str_newlines' visibility='default' filepath='./Modules/_io/_iomodule.c' line='37' column='1' elf-symbol-id='_PyIO_str_newlines'/>
    <var-decl name='_PyIO_str_nl' type-id='type-id-6' mangled-name='_PyIO_str_nl' visibility='default' filepath='./Modules/_io/_iomodule.c' line='38' column='1' elf-symbol-id='_PyIO_str_nl'/>
    <var-decl name='_PyIO_str_read' type-id='type-id-6' mangled-name='_PyIO_str_read' visibility='default' filepath='./Modules/_io/_iomodule.c' line='39' column='1' elf-symbol-id='_PyIO_str_read'/>
    <var-decl name='_PyIO_str_read1' type-id='type-id-6' mangled-name='_PyIO_str_read1' visibility='default' filepath='./Modules/_io/_iomodule.c' line='40' column='1' elf-symbol-id='_PyIO_str_read1'/>
    <var-decl name='_PyIO_str_readable' type-id='type-id-6' mangled-name='_PyIO_str_readable' visibility='default' filepath='./Modules/_io/_iomodule.c' line='41' column='1' elf-symbol-id='_PyIO_str_readable'/>
    <var-decl name='_PyIO_str_readall' type-id='type-id-6' mangled-name='_PyIO_str_readall' visibility='default' filepath='./Modules/_io/_iomodule.c' line='42' column='1' elf-symbol-id='_PyIO_str_readall'/>
    <var-decl name='_PyIO_str_readinto' type-id='type-id-6' mangled-name='_PyIO_str_readinto' visibility='default' filepath='./Modules/_io/_iomodule.c' line='43' column='1' elf-symbol-id='_PyIO_str_readinto'/>
    <var-decl name='_PyIO_str_readline' type-id='type-id-6' mangled-name='_PyIO_str_readline' visibility='default' filepath='./Modules/_io/_iomodule.c' line='44' column='1' elf-symbol-id='_PyIO_str_readline'/>
    <var-decl name='_PyIO_str_reset' type-id='type-id-6' mangled-name='_PyIO_str_reset' visibility='default' filepath='./Modules/_io/_iomodule.c' line='45' column='1' elf-symbol-id='_PyIO_str_reset'/>
    <var-decl name='_PyIO_str_seek' type-id='type-id-6' mangled-name='_PyIO_str_seek' visibility='default' filepath='./Modules/_io/_iomodule.c' line='46' column='1' elf-symbol-id='_PyIO_str_seek'/>
    <var-decl name='_PyIO_str_seekable' type-id='type-id-6' mangled-name='_PyIO_str_seekable' visibility='default' filepath='./Modules/_io/_iomodule.c' line='47' column='1' elf-symbol-id='_PyIO_str_seekable'/>
    <var-decl name='_PyIO_str_setstate' type-id='type-id-6' mangled-name='_PyIO_str_setstate' visibility='default' filepath='./Modules/_io/_iomodule.c' line='48' column='1' elf-symbol-id='_PyIO_str_setstate'/>
    <var-decl name='_PyIO_str_tell' type-id='type-id-6' mangled-name='_PyIO_str_tell' visibility='default' filepath='./Modules/_io/_iomodule.c' line='49' column='1' elf-symbol-id='_PyIO_str_tell'/>
    <var-decl name='_PyIO_str_truncate' type-id='type-id-6' mangled-name='_PyIO_str_truncate' visibility='default' filepath='./Modules/_io/_iomodule.c' line='50' column='1' elf-symbol-id='_PyIO_str_truncate'/>
    <var-decl name='_PyIO_str_writable' type-id='type-id-6' mangled-name='_PyIO_str_writable' visibility='default' filepath='./Modules/_io/_iomodule.c' line='51' column='1' elf-symbol-id='_PyIO_str_writable'/>
    <var-decl name='_PyIO_str_write' type-id='type-id-6' mangled-name='_PyIO_str_write' visibility='default' filepath='./Modules/_io/_iomodule.c' line='52' column='1' elf-symbol-id='_PyIO_str_write'/>
    <var-decl name='_PyIO_empty_str' type-id='type-id-6' mangled-name='_PyIO_empty_str' visibility='default' filepath='./Modules/_io/_iomodule.c' line='54' column='1' elf-symbol-id='_PyIO_empty_str'/>
    <var-decl name='_PyIO_empty_bytes' type-id='type-id-6' mangled-name='_PyIO_empty_bytes' visibility='default' filepath='./Modules/_io/_iomodule.c' line='55' column='1' elf-symbol-id='_PyIO_empty_bytes'/>
    <var-decl name='_PyIO_zero' type-id='type-id-6' mangled-name='_PyIO_zero' visibility='default' filepath='./Modules/_io/_iomodule.c' line='56' column='1' elf-symbol-id='_PyIO_zero'/>
    <function-decl name='PyNumber_AsOff_t' mangled-name='PyNumber_AsOff_t' filepath='./Modules/_io/_iomodule.c' line='501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_AsOff_t' hash='fb1738967c3f94b2'>
      <parameter type-id='type-id-6' name='item' filepath='./Modules/_io/_iomodule.c' line='501' column='1'/>
      <parameter type-id='type-id-6' name='err' filepath='./Modules/_io/_iomodule.c' line='501' column='1'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='_PyIO_ConvertSsize_t' mangled-name='_PyIO_ConvertSsize_t' filepath='./Modules/_io/_iomodule.c' line='547' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_ConvertSsize_t' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='obj' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <parameter type-id='type-id-48' name='result' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyIO_get_module_state' mangled-name='_PyIO_get_module_state' filepath='./Modules/_io/_iomodule.c' line='569' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_module_state' hash='ebe89f2173bc232b'>
      <return type-id='type-id-47'/>
    </function-decl>
    <function-decl name='_PyIO_get_locale_module' mangled-name='_PyIO_get_locale_module' filepath='./Modules/_io/_iomodule.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_get_locale_module' hash='a2b3225eb927bb40'>
      <parameter type-id='type-id-47' name='state' filepath='./Modules/_io/_iomodule.c' line='583' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='_PyIO_Module' type-id='type-id-49' mangled-name='_PyIO_Module' visibility='default' filepath='./Modules/_io/_iomodule.c' line='648' column='1' elf-symbol-id='_PyIO_Module'/>
    <function-decl name='PyInit__io' mangled-name='PyInit__io' filepath='./Modules/_io/_iomodule.c' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__io' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='PyIOBase_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='6' column='1'/>
    <var-decl name='PyRawIOBase_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='7' column='1'/>
    <var-decl name='PyBufferedIOBase_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='8' column='1'/>
    <var-decl name='PyTextIOBase_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='9' column='1'/>
    <var-decl name='PyFileIO_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='12' column='1'/>
    <var-decl name='PyBytesIO_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='13' column='1'/>
    <var-decl name='PyStringIO_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='14' column='1'/>
    <var-decl name='PyBufferedReader_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='15' column='1'/>
    <var-decl name='PyBufferedWriter_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='16' column='1'/>
    <var-decl name='PyBufferedRWPair_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='17' column='1'/>
    <var-decl name='PyBufferedRandom_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='18' column='1'/>
    <var-decl name='PyTextIOWrapper_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='19' column='1'/>
    <var-decl name='PyIncrementalNewlineDecoder_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='20' column='1'/>
    <var-decl name='_PyBytesIOBuffer_Type' type-id='type-id-12' visibility='default' filepath='./Modules/_io/_iomodule.h' line='188' column='1'/>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' hash='21e5a2f6e2b75eff' id='type-id-50'>
      <parameter type-id='type-id-6' name='obj' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <parameter type-id='type-id-48' name='result' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bufferedio.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__builtin_memmove' mangled-name='memmove' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyIO_trap_eintr' mangled-name='_PyIO_trap_eintr' filepath='./Modules/_io/bufferedio.c' line='790' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_trap_eintr' hash='388da3fa973fde78'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='memchr' mangled-name='memchr' filepath='/usr/include/string.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memchr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/bytesio.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/fileio.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='_PyFileIO_closed' mangled-name='_PyFileIO_closed' filepath='./Modules/_io/fileio.c' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFileIO_closed' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/fileio.c' line='84' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <var-decl name='_Py_open_cloexec_works' type-id='type-id-8' visibility='default' filepath='./Modules/_io/fileio.c' line='203' column='1'/>
    <function-decl name='__open_alias' mangled-name='open64' filepath='/usr/include/bits/fcntl2.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lseek' mangled-name='lseek64' filepath='/usr/include/unistd.h' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lseek64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='isatty' mangled-name='isatty' filepath='/usr/include/unistd.h' line='809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='isatty' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ftruncate' mangled-name='ftruncate64' filepath='/usr/include/unistd.h' line='1052' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftruncate64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' hash='21e5a2f6e2b75eff' id='type-id-51'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/fileio.c' line='84' column='1'/>
      <return type-id='type-id-8'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/iobase.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='_PyIOBase_check_closed' mangled-name='_PyIOBase_check_closed' filepath='./Modules/_io/iobase.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_closed' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyIOBase_finalize' mangled-name='_PyIOBase_finalize' filepath='./Modules/_io/iobase.c' line='282' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_finalize' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/fileio.c' line='84' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_seekable' mangled-name='_PyIOBase_check_seekable' filepath='./Modules/_io/iobase.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_seekable' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_readable' mangled-name='_PyIOBase_check_readable' filepath='./Modules/_io/iobase.c' line='387' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_readable' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyIOBase_check_writable' mangled-name='_PyIOBase_check_writable' filepath='./Modules/_io/iobase.c' line='420' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIOBase_check_writable' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-type size-in-bits='64' hash='2e839175b6f0d64e' id='type-id-52'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/stringio.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_io/textio.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='_PyIncrementalNewlineDecoder_decode' mangled-name='_PyIncrementalNewlineDecoder_decode' filepath='./Modules/_io/textio.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIncrementalNewlineDecoder_decode' hash='7736598d5f603cb3'>
      <parameter type-id='type-id-6' name='myself' filepath='./Modules/_io/textio.c' line='311' column='1'/>
      <parameter type-id='type-id-6' name='input' filepath='./Modules/_io/textio.c' line='312' column='1'/>
      <parameter type-id='type-id-8' name='final' filepath='./Modules/_io/textio.c' line='312' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyIO_find_line_ending' mangled-name='_PyIO_find_line_ending' filepath='./Modules/_io/textio.c' line='1695' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyIO_find_line_ending' hash='5614a966f22873e2'>
      <parameter type-id='type-id-8' name='translated' filepath='./Modules/_io/textio.c' line='1696' column='1'/>
      <parameter type-id='type-id-8' name='universal' filepath='./Modules/_io/textio.c' line='1696' column='1'/>
      <parameter type-id='type-id-6' name='readnl' filepath='./Modules/_io/textio.c' line='1696' column='1'/>
      <parameter type-id='type-id-8' name='kind' filepath='./Modules/_io/textio.c' line='1697' column='1'/>
      <parameter type-id='type-id-15' name='start' filepath='./Modules/_io/textio.c' line='1697' column='1'/>
      <parameter type-id='type-id-15' name='end' filepath='./Modules/_io/textio.c' line='1697' column='1'/>
      <parameter type-id='type-id-53' name='consumed' filepath='./Modules/_io/textio.c' line='1697' column='1'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7736598d5f603cb3' id='type-id-55'>
      <parameter type-id='type-id-6' name='myself' filepath='./Modules/_io/textio.c' line='311' column='1'/>
      <parameter type-id='type-id-6' name='input' filepath='./Modules/_io/textio.c' line='312' column='1'/>
      <parameter type-id='type-id-8' name='final' filepath='./Modules/_io/textio.c' line='312' column='1'/>
      <return type-id='type-id-6'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_localemodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit__locale' mangled-name='PyInit__locale' filepath='./Modules/_localemodule.c' line='720' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__locale' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='nl_langinfo' mangled-name='nl_langinfo' filepath='/usr/include/langinfo.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nl_langinfo' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dcgettext' mangled-name='dcgettext' filepath='/usr/include/libintl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dcgettext' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='textdomain' mangled-name='textdomain' filepath='/usr/include/libintl.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='textdomain' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='bindtextdomain' mangled-name='bindtextdomain' filepath='/usr/include/libintl.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bindtextdomain' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='bind_textdomain_codeset' mangled-name='bind_textdomain_codeset' filepath='/usr/include/libintl.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bind_textdomain_codeset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setlocale' mangled-name='setlocale' filepath='/usr/include/locale.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setlocale' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='localeconv' mangled-name='localeconv' filepath='/usr/include/locale.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='localeconv' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcscoll' mangled-name='wcscoll' filepath='/usr/include/wchar.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscoll' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcsxfrm' mangled-name='wcsxfrm' filepath='/usr/include/wchar.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsxfrm' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcslen' mangled-name='wcslen' filepath='/usr/include/wchar.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcslen' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_operator.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit__operator' mangled-name='PyInit__operator' filepath='./Modules/_operator.c' line='1208' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__operator' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_sre.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__sre' mangled-name='PyInit__sre' filepath='./Modules/_sre.c' line='2922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__sre' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__ctype_tolower_loc' mangled-name='__ctype_tolower_loc' filepath='/usr/include/ctype.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_tolower_loc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__ctype_toupper_loc' mangled-name='__ctype_toupper_loc' filepath='/usr/include/ctype.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_toupper_loc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_stat.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit__stat' mangled-name='PyInit__stat' filepath='./Modules/_stat.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__stat' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_threadmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit__thread' mangled-name='PyInit__thread' filepath='./Modules/_threadmodule.c' line='1359' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__thread' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='floor' mangled-name='floor' filepath='/usr/include/bits/mathcalls.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='floor' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_tracemalloc.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <typedef-decl name='_PyTraceMalloc_domain_t' type-id='type-id-56' size-in-bits='32' filepath='./Include/pymem.h' line='29' column='1' hash='e66b43f97c38e87a' id='type-id-57'/>
    <typedef-decl name='uintptr_t' type-id='type-id-58' size-in-bits='64' filepath='/usr/include/stdint.h' line='90' column='1' hash='8fdc5eea2983a729' id='type-id-59'/>
    <var-decl name='PyFrame_Type' type-id='type-id-12' visibility='default' filepath='./Include/frameobject.h' line='58' column='1'/>
    <function-decl name='_PyMem_DumpTraceback' mangled-name='_PyMem_DumpTraceback' filepath='./Modules/_tracemalloc.c' line='1490' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyMem_DumpTraceback' hash='388da3fa973fde78'>
      <parameter type-id='type-id-8' name='fd' filepath='./Modules/_tracemalloc.c' line='1490' column='1'/>
      <parameter type-id='type-id-48' name='ptr' filepath='./Modules/_tracemalloc.c' line='1490' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit__tracemalloc' mangled-name='PyInit__tracemalloc' filepath='./Modules/_tracemalloc.c' line='1662' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__tracemalloc' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Init' mangled-name='_PyTraceMalloc_Init' filepath='./Modules/_tracemalloc.c' line='1706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Init' hash='388da3fa973fde78'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Fini' mangled-name='_PyTraceMalloc_Fini' filepath='./Modules/_tracemalloc.c' line='1764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Fini' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Track' mangled-name='_PyTraceMalloc_Track' filepath='./Modules/_tracemalloc.c' line='1773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Track' hash='5dd50de4305c17ee'>
      <parameter type-id='type-id-57' name='domain' filepath='./Modules/_tracemalloc.c' line='1773' column='1'/>
      <parameter type-id='type-id-59' name='ptr' filepath='./Modules/_tracemalloc.c' line='1773' column='1'/>
      <parameter type-id='type-id-60' name='size' filepath='./Modules/_tracemalloc.c' line='1774' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_Untrack' mangled-name='_PyTraceMalloc_Untrack' filepath='./Modules/_tracemalloc.c' line='1802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_Untrack' hash='fefa91292300ff4f'>
      <parameter type-id='type-id-57' name='domain' filepath='./Modules/_tracemalloc.c' line='1802' column='1'/>
      <parameter type-id='type-id-59' name='ptr' filepath='./Modules/_tracemalloc.c' line='1802' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyTraceMalloc_GetTraceback' mangled-name='_PyTraceMalloc_GetTraceback' filepath='./Modules/_tracemalloc.c' line='1818' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyTraceMalloc_GetTraceback' hash='acba6a6991d7eaa9'>
      <parameter type-id='type-id-57' name='domain' filepath='./Modules/_tracemalloc.c' line='1818' column='1'/>
      <parameter type-id='type-id-59' name='ptr' filepath='./Modules/_tracemalloc.c' line='1818' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='__isoc23_strtol' filepath='/usr/include/stdlib.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtol' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getenv' mangled-name='getenv' filepath='/usr/include/stdlib.h' line='773' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getenv' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/_weakref.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit__weakref' mangled-name='PyInit__weakref' filepath='./Modules/_weakref.c' line='153' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__weakref' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/atexitmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_atexit' mangled-name='PyInit_atexit' filepath='./Modules/atexitmodule.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_atexit' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/errnomodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_errno' mangled-name='PyInit_errno' filepath='./Modules/errnomodule.c' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_errno' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/faulthandler.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_faulthandler' mangled-name='PyInit_faulthandler' filepath='./Modules/faulthandler.c' line='1252' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_faulthandler' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyFaulthandler_Init' mangled-name='_PyFaulthandler_Init' filepath='./Modules/faulthandler.c' line='1323' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Init' hash='388da3fa973fde78'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PyFaulthandler_Fini' mangled-name='_PyFaulthandler_Fini' filepath='./Modules/faulthandler.c' line='1357' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyFaulthandler_Fini' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='modf' mangled-name='modf' filepath='/usr/include/bits/mathcalls.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='modf' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_sigmask' mangled-name='pthread_sigmask' filepath='/usr/include/bits/sigthread.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_sigmask' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='raise' mangled-name='raise' filepath='/usr/include/signal.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='raise' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigemptyset' mangled-name='sigemptyset' filepath='/usr/include/signal.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigemptyset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigfillset' mangled-name='sigfillset' filepath='/usr/include/signal.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigfillset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigaction' mangled-name='sigaction' filepath='/usr/include/signal.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaction' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigaltstack' mangled-name='sigaltstack' filepath='/usr/include/signal.h' line='333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaltstack' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='abort' mangled-name='abort' filepath='/usr/include/stdlib.h' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='abort' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getrlimit' mangled-name='getrlimit64' filepath='/usr/include/sys/resource.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrlimit64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setrlimit' mangled-name='setrlimit64' filepath='/usr/include/sys/resource.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setrlimit64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_exit' mangled-name='_exit' filepath='/usr/include/unistd.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_exit' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sysconf' mangled-name='sysconf' filepath='/usr/include/unistd.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sysconf' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getbuildinfo.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-61' size-in-bits='1600' hash='4b439ea14699207c' id='type-id-62'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-63'/>
    </array-type-def>
    <type-decl name='atomic_uintptr_t' size-in-bits='64' hash='da895f807b0563db' id='type-id-64'/>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-9'/>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' hash='ae8794bd02a63036' id='type-id-34'>
      <subrange length='2' lower-bound='0' upper-bound='1' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='95f31efc53154467' id='type-id-65'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-66'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-63'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='160' hash='99641d293d1da856' id='type-id-67'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='1ca9e41140ea49be' id='type-id-68'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-9' size-in-bits='unknown' hash='6915b710ae33e54a' id='type-id-14'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-69'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='2048' hash='1797cfb1220b91e9' id='type-id-24'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-71'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-70' size-in-bits='unknown' hash='203cf93a929eab6d' id='type-id-32'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-69'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-72' size-in-bits='8192' hash='de77d436300019c1' id='type-id-23'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-71'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-73' size-in-bits='32' hash='3c9845b3c023dab1' id='type-id-74'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-63'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-75'/>
    <array-type-def dimensions='1' type-id='type-id-76' size-in-bits='16320' hash='1caea7923ea93d98' id='type-id-77'>
      <subrange length='255' lower-bound='0' upper-bound='254' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='32d21d641e8f81a1' id='type-id-78'/>
    </array-type-def>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-8'/>
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='unknown' hash='34b1de78483f9fed' id='type-id-21'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-69'/>
    </array-type-def>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-35'/>
    <array-type-def dimensions='1' type-id='type-id-35' size-in-bits='512' hash='8e4c722572470e23' id='type-id-79'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-80'/>
    </array-type-def>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-81'/>
    <class-decl name='PyAsyncMethods' is-struct='yes' naming-typedef-id='type-id-82' visibility='default' size-in-bits='192' filepath='./Include/object.h' line='307' column='1' hash='78ce204ad0e9b16f' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='am_await' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='am_aiter' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='am_anext' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='310' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyBufferProcs' is-struct='yes' naming-typedef-id='type-id-85' visibility='default' size-in-bits='128' filepath='./Include/object.h' line='313' column='1' hash='312f0a84f63d80f7' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='bf_getbuffer' type-id='type-id-87' visibility='default' filepath='./Include/object.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='bf_releasebuffer' type-id='type-id-88' visibility='default' filepath='./Include/object.h' line='315' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyGetSetDef' is-struct='yes' visibility='default' size-in-bits='320' filepath='./Include/descrobject.h' line='11' column='1' hash='de0567a8b051592d' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-19' visibility='default' filepath='./Include/descrobject.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='get' type-id='type-id-90' visibility='default' filepath='./Include/descrobject.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='set' type-id='type-id-91' visibility='default' filepath='./Include/descrobject.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='doc' type-id='type-id-19' visibility='default' filepath='./Include/descrobject.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='closure' type-id='type-id-48' visibility='default' filepath='./Include/descrobject.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMappingMethods' is-struct='yes' naming-typedef-id='type-id-92' visibility='default' size-in-bits='192' filepath='./Include/object.h' line='301' column='1' hash='81b273045fe2396c' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mp_length' type-id='type-id-94' visibility='default' filepath='./Include/object.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mp_subscript' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mp_ass_subscript' type-id='type-id-96' visibility='default' filepath='./Include/object.h' line='304' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyMethodDef' is-struct='yes' visibility='default' size-in-bits='256' filepath='./Include/methodobject.h' line='54' column='1' hash='288eb1f4533102be' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ml_name' type-id='type-id-15' visibility='default' filepath='./Include/methodobject.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ml_meth' type-id='type-id-98' visibility='default' filepath='./Include/methodobject.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ml_flags' type-id='type-id-8' visibility='default' filepath='./Include/methodobject.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ml_doc' type-id='type-id-15' visibility='default' filepath='./Include/methodobject.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyNumberMethods' is-struct='yes' naming-typedef-id='type-id-99' visibility='default' size-in-bits='2304' filepath='./Include/object.h' line='240' column='1' hash='ffa845cb1037644a' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nb_add' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nb_subtract' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nb_multiply' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nb_remainder' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nb_divmod' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nb_power' type-id='type-id-101' visibility='default' filepath='./Include/object.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nb_negative' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nb_positive' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nb_absolute' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='nb_bool' type-id='type-id-102' visibility='default' filepath='./Include/object.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='nb_invert' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='nb_lshift' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='nb_rshift' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='nb_and' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='nb_xor' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='nb_or' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='nb_int' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nb_reserved' type-id='type-id-48' visibility='default' filepath='./Include/object.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='nb_float' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='nb_inplace_add' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='nb_inplace_subtract' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='nb_inplace_multiply' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='nb_inplace_remainder' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='nb_inplace_power' type-id='type-id-101' visibility='default' filepath='./Include/object.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='nb_inplace_lshift' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='nb_inplace_rshift' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='nb_inplace_and' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='nb_inplace_xor' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='nb_inplace_or' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='nb_floor_divide' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='nb_true_divide' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='nb_inplace_floor_divide' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='nb_inplace_true_divide' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='nb_index' type-id='type-id-84' visibility='default' filepath='./Include/object.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='nb_matrix_multiply' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='nb_inplace_matrix_multiply' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='284' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PySequenceMethods' is-struct='yes' naming-typedef-id='type-id-103' visibility='default' size-in-bits='640' filepath='./Include/object.h' line='287' column='1' hash='7adbc4f0f7eb0098' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sq_length' type-id='type-id-94' visibility='default' filepath='./Include/object.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='sq_concat' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='sq_repeat' type-id='type-id-105' visibility='default' filepath='./Include/object.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='sq_item' type-id='type-id-105' visibility='default' filepath='./Include/object.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='was_sq_slice' type-id='type-id-48' visibility='default' filepath='./Include/object.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sq_ass_item' type-id='type-id-106' visibility='default' filepath='./Include/object.h' line='293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='was_sq_ass_slice' type-id='type-id-48' visibility='default' filepath='./Include/object.h' line='294' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sq_contains' type-id='type-id-107' visibility='default' filepath='./Include/object.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sq_inplace_concat' type-id='type-id-95' visibility='default' filepath='./Include/object.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='sq_inplace_repeat' type-id='type-id-105' visibility='default' filepath='./Include/object.h' line='298' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='PyVarObject' is-struct='yes' naming-typedef-id='type-id-3' visibility='default' size-in-bits='192' filepath='./Include/object.h' line='112' column='1' hash='b304cd0e55c619cd' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-20' visibility='default' filepath='./Include/object.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ob_size' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='114' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' hash='54bf40f701b4847a' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-110' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-111' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-112' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-113' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-66' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-114' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-46' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-115' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-116' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-111' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-60' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-67' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_atomic_address' is-struct='yes' visibility='default' size-in-bits='64' filepath='./Include/pyatomic.h' line='32' column='1' hash='d16d5f5b185595b7' id='type-id-117'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_value' type-id='type-id-64' visibility='default' filepath='./Include/pyatomic.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__jmp_buf_tag' is-struct='yes' visibility='default' size-in-bits='1600' filepath='/usr/include/bits/types/struct___jmp_buf_tag.h' line='26' column='1' hash='0d7cc580e71a7367' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__jmpbuf' type-id='type-id-118' visibility='default' filepath='/usr/include/bits/types/struct___jmp_buf_tag.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='__mask_was_saved' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/types/struct___jmp_buf_tag.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='__saved_mask' type-id='type-id-119' visibility='default' filepath='/usr/include/bits/types/struct___jmp_buf_tag.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__sigset_t' is-struct='yes' naming-typedef-id='type-id-119' visibility='default' size-in-bits='1024' filepath='/usr/include/bits/types/__sigset_t.h' line='5' column='1' hash='18950dbdbe728dbc' id='type-id-120'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__val' type-id='type-id-121' visibility='default' filepath='/usr/include/bits/types/__sigset_t.h' line='7' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_frozen' is-struct='yes' visibility='default' size-in-bits='192' filepath='./Include/import.h' line='125' column='1' hash='3f7e02a7f9db91ec' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='./Include/import.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='code' type-id='type-id-123' visibility='default' filepath='./Include/import.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size' type-id='type-id-8' visibility='default' filepath='./Include/import.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_inittab' is-struct='yes' visibility='default' size-in-bits='128' filepath='./Include/import.h' line='109' column='1' hash='7af64a909a8b2ffa' id='type-id-124'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-15' visibility='default' filepath='./Include/import.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='initfunc' type-id='type-id-125' visibility='default' filepath='./Include/import.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_is' is-struct='yes' visibility='default' size-in-bits='960' filepath='./Include/pystate.h' line='26' column='1' hash='e94774ed8c46390e' id='type-id-126'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-127' visibility='default' filepath='./Include/pystate.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tstate_head' type-id='type-id-128' visibility='default' filepath='./Include/pystate.h' line='29' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='modules' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='modules_by_index' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sysdict' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='builtins' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='importlib' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='codec_search_path' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='codec_search_cache' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='codec_error_registry' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='codecs_initialized' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='fscodec_initialized' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='dlopenflags' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='builtins_copy' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='import_func' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='eval_frame' type-id='type-id-129' visibility='default' filepath='./Include/pystate.h' line='50' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_longobject' is-struct='yes' visibility='default' size-in-bits='256' filepath='./Include/longintrepr.h' line='85' column='1' hash='9e9427d61e872b13' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-3' visibility='default' filepath='./Include/longintrepr.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ob_digit' type-id='type-id-74' visibility='default' filepath='./Include/longintrepr.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_object' is-struct='yes' visibility='default' size-in-bits='128' filepath='./Include/object.h' line='106' column='1' hash='a5bc418556401449' id='type-id-130'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_refcnt' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ob_type' type-id='type-id-131' visibility='default' filepath='./Include/object.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_ts' is-struct='yes' visibility='default' size-in-bits='18176' filepath='./Include/pystate.h' line='84' column='1' hash='5c9f95b6c17aa552' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prev' type-id='type-id-128' visibility='default' filepath='./Include/pystate.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-128' visibility='default' filepath='./Include/pystate.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='interp' type-id='type-id-133' visibility='default' filepath='./Include/pystate.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='frame' type-id='type-id-4' visibility='default' filepath='./Include/pystate.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='recursion_depth' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='overflowed' type-id='type-id-9' visibility='default' filepath='./Include/pystate.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='296'>
        <var-decl name='recursion_critical' type-id='type-id-9' visibility='default' filepath='./Include/pystate.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tracing' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='use_tracing' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='c_profilefunc' type-id='type-id-134' visibility='default' filepath='./Include/pystate.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='c_tracefunc' type-id='type-id-134' visibility='default' filepath='./Include/pystate.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='c_profileobj' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='c_traceobj' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='curexc_type' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='109' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='curexc_value' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='curexc_traceback' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='exc_type' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='exc_value' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='exc_traceback' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='dict' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='gilstate_counter' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='async_exc' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='thread_id' type-id='type-id-35' visibility='default' filepath='./Include/pystate.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='trash_delete_nesting' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='trash_delete_later' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='on_delete' type-id='type-id-135' visibility='default' filepath='./Include/pystate.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='on_delete_data' type-id='type-id-48' visibility='default' filepath='./Include/pystate.h' line='151' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='coroutine_wrapper' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='in_coroutine_wrapper' type-id='type-id-8' visibility='default' filepath='./Include/pystate.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_preserve_36_ABI_1' type-id='type-id-54' visibility='default' filepath='./Include/pystate.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='_preserve_36_ABI_2' type-id='type-id-77' visibility='default' filepath='./Include/pystate.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18048'>
        <var-decl name='async_gen_firstiter' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='18112'>
        <var-decl name='async_gen_finalizer' type-id='type-id-6' visibility='default' filepath='./Include/pystate.h' line='162' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_typeobject' is-struct='yes' visibility='default' size-in-bits='3200' filepath='./Include/object.h' line='346' column='1' hash='8f7c303f97efbc5b' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ob_base' type-id='type-id-3' visibility='default' filepath='./Include/object.h' line='347' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tp_name' type-id='type-id-15' visibility='default' filepath='./Include/object.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tp_basicsize' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tp_itemsize' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tp_dealloc' type-id='type-id-137' visibility='default' filepath='./Include/object.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='tp_print' type-id='type-id-138' visibility='default' filepath='./Include/object.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='tp_getattr' type-id='type-id-139' visibility='default' filepath='./Include/object.h' line='355' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='tp_setattr' type-id='type-id-140' visibility='default' filepath='./Include/object.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='tp_as_async' type-id='type-id-141' visibility='default' filepath='./Include/object.h' line='357' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='tp_repr' type-id='type-id-142' visibility='default' filepath='./Include/object.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='tp_as_number' type-id='type-id-143' visibility='default' filepath='./Include/object.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='tp_as_sequence' type-id='type-id-144' visibility='default' filepath='./Include/object.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='tp_as_mapping' type-id='type-id-145' visibility='default' filepath='./Include/object.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='tp_hash' type-id='type-id-146' visibility='default' filepath='./Include/object.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='tp_call' type-id='type-id-101' visibility='default' filepath='./Include/object.h' line='370' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='tp_str' type-id='type-id-142' visibility='default' filepath='./Include/object.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='tp_getattro' type-id='type-id-147' visibility='default' filepath='./Include/object.h' line='372' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='tp_setattro' type-id='type-id-148' visibility='default' filepath='./Include/object.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='tp_as_buffer' type-id='type-id-149' visibility='default' filepath='./Include/object.h' line='376' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='tp_flags' type-id='type-id-58' visibility='default' filepath='./Include/object.h' line='379' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='tp_doc' type-id='type-id-15' visibility='default' filepath='./Include/object.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='tp_traverse' type-id='type-id-150' visibility='default' filepath='./Include/object.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='tp_clear' type-id='type-id-102' visibility='default' filepath='./Include/object.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='tp_richcompare' type-id='type-id-151' visibility='default' filepath='./Include/object.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='tp_weaklistoffset' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='tp_iter' type-id='type-id-152' visibility='default' filepath='./Include/object.h' line='398' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='tp_iternext' type-id='type-id-153' visibility='default' filepath='./Include/object.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tp_methods' type-id='type-id-154' visibility='default' filepath='./Include/object.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='tp_members' type-id='type-id-155' visibility='default' filepath='./Include/object.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='tp_getset' type-id='type-id-156' visibility='default' filepath='./Include/object.h' line='404' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='tp_base' type-id='type-id-131' visibility='default' filepath='./Include/object.h' line='405' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tp_dict' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='tp_descr_get' type-id='type-id-157' visibility='default' filepath='./Include/object.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='tp_descr_set' type-id='type-id-158' visibility='default' filepath='./Include/object.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='tp_dictoffset' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tp_init' type-id='type-id-159' visibility='default' filepath='./Include/object.h' line='410' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='tp_alloc' type-id='type-id-160' visibility='default' filepath='./Include/object.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='tp_new' type-id='type-id-161' visibility='default' filepath='./Include/object.h' line='412' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='tp_free' type-id='type-id-76' visibility='default' filepath='./Include/object.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tp_is_gc' type-id='type-id-102' visibility='default' filepath='./Include/object.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='tp_bases' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='415' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='tp_mro' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='tp_cache' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='tp_subclasses' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='tp_weaklist' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='419' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='tp_del' type-id='type-id-137' visibility='default' filepath='./Include/object.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='tp_version_tag' type-id='type-id-56' visibility='default' filepath='./Include/object.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='tp_finalize' type-id='type-id-137' visibility='default' filepath='./Include/object.h' line='425' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='bufferinfo' is-struct='yes' visibility='default' size-in-bits='640' filepath='./Include/object.h' line='182' column='1' hash='9577c54fd4e83e61' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buf' type-id='type-id-48' visibility='default' filepath='./Include/object.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='obj' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='len' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='itemsize' type-id='type-id-54' visibility='default' filepath='./Include/object.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='readonly' type-id='type-id-8' visibility='default' filepath='./Include/object.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='ndim' type-id='type-id-8' visibility='default' filepath='./Include/object.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='format' type-id='type-id-19' visibility='default' filepath='./Include/object.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='shape' type-id='type-id-53' visibility='default' filepath='./Include/object.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strides' type-id='type-id-53' visibility='default' filepath='./Include/object.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='suboffsets' type-id='type-id-53' visibility='default' filepath='./Include/object.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='internal' type-id='type-id-48' visibility='default' filepath='./Include/object.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='./Include/pyhash.h' line='58' column='1' hash='ac4afdc70762a6ab' id='type-id-163'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='prefix' type-id='type-id-164' visibility='default' filepath='./Include/pyhash.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suffix' type-id='type-id-164' visibility='default' filepath='./Include/pyhash.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='./Include/objimpl.h' line='253' column='1' hash='90cd88375a7f966c#2' id='type-id-165'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gc_next' type-id='type-id-166' visibility='default' filepath='./Include/objimpl.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gc_prev' type-id='type-id-166' visibility='default' filepath='./Include/objimpl.h' line='255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gc_refs' type-id='type-id-54' visibility='default' filepath='./Include/objimpl.h' line='256' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' is-struct='yes' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='./Include/pyhash.h' line='63' column='1' hash='9d012b2553493800#45' id='type-id-167'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='k0' type-id='type-id-168' visibility='default' filepath='./Include/pyhash.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='k1' type-id='type-id-168' visibility='default' filepath='./Include/pyhash.h' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='./Include/pyhash.h' line='72' column='1' hash='ecab53fd746c155e#47' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='padding' type-id='type-id-170' visibility='default' filepath='./Include/pyhash.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hashsalt' type-id='type-id-164' visibility='default' filepath='./Include/pyhash.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' is-struct='yes' visibility='default' size-in-bits='192' is-anonymous='yes' filepath='./Include/pyhash.h' line='68' column='1' hash='793c7a7b430b2b5f#48' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='padding' type-id='type-id-170' visibility='default' filepath='./Include/pyhash.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='suffix' type-id='type-id-164' visibility='default' filepath='./Include/pyhash.h' line='70' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-109' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-172'/>
    <typedef-decl name='PyAsyncMethods' type-id='type-id-83' size-in-bits='192' filepath='./Include/object.h' line='311' column='1' id='type-id-82'/>
    <typedef-decl name='PyBufferProcs' type-id='type-id-86' size-in-bits='128' filepath='./Include/object.h' line='316' column='1' id='type-id-85'/>
    <typedef-decl name='PyCFunction' type-id='type-id-173' size-in-bits='64' filepath='./Include/methodobject.h' line='18' column='1' hash='fd7a63c0c6c822c4' id='type-id-98'/>
    <typedef-decl name='PyGC_Head' type-id='type-id-174' size-in-bits='192' filepath='./Include/objimpl.h' line='259' column='1' id='type-id-175'/>
    <typedef-decl name='PyInterpreterState' type-id='type-id-126' size-in-bits='960' filepath='./Include/pystate.h' line='51' column='1' id='type-id-176'/>
    <typedef-decl name='PyMappingMethods' type-id='type-id-93' size-in-bits='192' filepath='./Include/object.h' line='305' column='1' id='type-id-92'/>
    <typedef-decl name='PyNumberMethods' type-id='type-id-100' size-in-bits='2304' filepath='./Include/object.h' line='285' column='1' id='type-id-99'/>
    <typedef-decl name='PyObject' type-id='type-id-130' size-in-bits='128' filepath='./Include/object.h' line='110' column='1' id='type-id-20'/>
    <typedef-decl name='PySequenceMethods' type-id='type-id-104' size-in-bits='640' filepath='./Include/object.h' line='299' column='1' id='type-id-103'/>
    <typedef-decl name='PyThreadFrameGetter' type-id='type-id-177' size-in-bits='64' filepath='./Include/pystate.h' line='314' column='1' hash='fd7a63c0c6c822c4' id='type-id-29'/>
    <typedef-decl name='PyThreadState' type-id='type-id-132' size-in-bits='18176' filepath='./Include/pystate.h' line='166' column='1' id='type-id-178'/>
    <typedef-decl name='PyTypeObject' type-id='type-id-136' size-in-bits='3200' filepath='./Include/object.h' line='435' column='1' id='type-id-12'/>
    <typedef-decl name='PyVarObject' type-id='type-id-108' size-in-bits='192' filepath='./Include/object.h' line='115' column='1' id='type-id-3'/>
    <typedef-decl name='Py_buffer' type-id='type-id-162' size-in-bits='640' filepath='./Include/object.h' line='195' column='1' id='type-id-179'/>
    <typedef-decl name='Py_hash_t' type-id='type-id-54' size-in-bits='64' filepath='./Include/pyport.h' line='93' column='1' hash='b119fe0931d2ee10' id='type-id-164'/>
    <typedef-decl name='Py_ssize_t' type-id='type-id-180' size-in-bits='64' filepath='./Include/pyport.h' line='84' column='1' hash='b119fe0931d2ee10' id='type-id-54'/>
    <typedef-decl name='Py_tracefunc' type-id='type-id-181' size-in-bits='64' filepath='./Include/pystate.h' line='69' column='1' hash='fd7a63c0c6c822c4' id='type-id-134'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-1' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-182'/>
    <typedef-decl name='_PyFrameEvalFunction' type-id='type-id-183' size-in-bits='64' filepath='./Include/pystate.h' line='24' column='1' hash='fd7a63c0c6c822c4' id='type-id-129'/>
    <typedef-decl name='_Py_HashSecret_t' type-id='type-id-184' size-in-bits='192' filepath='./Include/pyhash.h' line='76' column='1' id='type-id-26'/>
    <typedef-decl name='_Py_atomic_address' type-id='type-id-117' size-in-bits='64' filepath='./Include/pyatomic.h' line='34' column='1' id='type-id-28'/>
    <typedef-decl name='__jmp_buf' type-id='type-id-79' size-in-bits='512' filepath='/usr/include/bits/setjmp.h' line='31' column='1' hash='8e4c722572470e23' id='type-id-118'/>
    <typedef-decl name='__off64_t' type-id='type-id-35' size-in-bits='64' filepath='/usr/include/bits/types.h' line='153' column='1' hash='b119fe0931d2ee10' id='type-id-46'/>
    <typedef-decl name='__off_t' type-id='type-id-35' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-112'/>
    <typedef-decl name='__sigset_t' type-id='type-id-120' size-in-bits='1024' filepath='/usr/include/bits/types/__sigset_t.h' line='8' column='1' id='type-id-119'/>
    <typedef-decl name='__ssize_t' type-id='type-id-35' size-in-bits='64' filepath='/usr/include/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-185'/>
    <typedef-decl name='__uint32_t' type-id='type-id-56' size-in-bits='32' filepath='/usr/include/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-186'/>
    <typedef-decl name='__uint64_t' type-id='type-id-58' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-187'/>
    <typedef-decl name='allocfunc' type-id='type-id-188' size-in-bits='64' filepath='./Include/object.h' line='341' column='1' hash='fd7a63c0c6c822c4' id='type-id-160'/>
    <typedef-decl name='binaryfunc' type-id='type-id-173' size-in-bits='64' filepath='./Include/object.h' line='170' column='1' hash='fd7a63c0c6c822c4' id='type-id-95'/>
    <typedef-decl name='descrgetfunc' type-id='type-id-189' size-in-bits='64' filepath='./Include/object.h' line='337' column='1' hash='fd7a63c0c6c822c4' id='type-id-157'/>
    <typedef-decl name='descrsetfunc' type-id='type-id-190' size-in-bits='64' filepath='./Include/object.h' line='338' column='1' hash='fd7a63c0c6c822c4' id='type-id-158'/>
    <typedef-decl name='destructor' type-id='type-id-191' size-in-bits='64' filepath='./Include/object.h' line='320' column='1' hash='fd7a63c0c6c822c4' id='type-id-137'/>
    <typedef-decl name='digit' type-id='type-id-192' size-in-bits='32' filepath='./Include/longintrepr.h' line='45' column='1' hash='e66b43f97c38e87a' id='type-id-73'/>
    <typedef-decl name='freefunc' type-id='type-id-135' size-in-bits='64' filepath='./Include/object.h' line='319' column='1' hash='fd7a63c0c6c822c4' id='type-id-76'/>
    <typedef-decl name='getattrfunc' type-id='type-id-193' size-in-bits='64' filepath='./Include/object.h' line='328' column='1' hash='fd7a63c0c6c822c4' id='type-id-139'/>
    <typedef-decl name='getattrofunc' type-id='type-id-173' size-in-bits='64' filepath='./Include/object.h' line='329' column='1' hash='fd7a63c0c6c822c4' id='type-id-147'/>
    <typedef-decl name='getbufferproc' type-id='type-id-194' size-in-bits='64' filepath='./Include/object.h' line='197' column='1' hash='fd7a63c0c6c822c4' id='type-id-87'/>
    <typedef-decl name='getiterfunc' type-id='type-id-195' size-in-bits='64' filepath='./Include/object.h' line='335' column='1' hash='fd7a63c0c6c822c4' id='type-id-152'/>
    <typedef-decl name='getter' type-id='type-id-196' size-in-bits='64' filepath='./Include/descrobject.h' line='8' column='1' hash='fd7a63c0c6c822c4' id='type-id-90'/>
    <typedef-decl name='hashfunc' type-id='type-id-197' size-in-bits='64' filepath='./Include/object.h' line='333' column='1' hash='fd7a63c0c6c822c4' id='type-id-146'/>
    <typedef-decl name='initproc' type-id='type-id-190' size-in-bits='64' filepath='./Include/object.h' line='339' column='1' hash='fd7a63c0c6c822c4' id='type-id-159'/>
    <typedef-decl name='inquiry' type-id='type-id-198' size-in-bits='64' filepath='./Include/object.h' line='172' column='1' hash='fd7a63c0c6c822c4' id='type-id-102'/>
    <typedef-decl name='iternextfunc' type-id='type-id-195' size-in-bits='64' filepath='./Include/object.h' line='336' column='1' hash='fd7a63c0c6c822c4' id='type-id-153'/>
    <typedef-decl name='jmp_buf' type-id='type-id-62' size-in-bits='1600' filepath='/usr/include/setjmp.h' line='32' column='1' hash='4b439ea14699207c' id='type-id-25'/>
    <typedef-decl name='lenfunc' type-id='type-id-199' size-in-bits='64' filepath='./Include/object.h' line='173' column='1' hash='fd7a63c0c6c822c4' id='type-id-94'/>
    <typedef-decl name='newfunc' type-id='type-id-200' size-in-bits='64' filepath='./Include/object.h' line='340' column='1' hash='fd7a63c0c6c822c4' id='type-id-161'/>
    <typedef-decl name='objobjargproc' type-id='type-id-190' size-in-bits='64' filepath='./Include/object.h' line='178' column='1' hash='fd7a63c0c6c822c4' id='type-id-96'/>
    <typedef-decl name='objobjproc' type-id='type-id-201' size-in-bits='64' filepath='./Include/object.h' line='235' column='1' hash='fd7a63c0c6c822c4' id='type-id-107'/>
    <typedef-decl name='printfunc' type-id='type-id-202' size-in-bits='64' filepath='./Include/object.h' line='326' column='1' hash='fd7a63c0c6c822c4' id='type-id-138'/>
    <typedef-decl name='releasebufferproc' type-id='type-id-203' size-in-bits='64' filepath='./Include/object.h' line='198' column='1' hash='fd7a63c0c6c822c4' id='type-id-88'/>
    <typedef-decl name='reprfunc' type-id='type-id-195' size-in-bits='64' filepath='./Include/object.h' line='332' column='1' hash='fd7a63c0c6c822c4' id='type-id-142'/>
    <typedef-decl name='richcmpfunc' type-id='type-id-204' size-in-bits='64' filepath='./Include/object.h' line='334' column='1' hash='fd7a63c0c6c822c4' id='type-id-151'/>
    <typedef-decl name='setattrfunc' type-id='type-id-205' size-in-bits='64' filepath='./Include/object.h' line='330' column='1' hash='fd7a63c0c6c822c4' id='type-id-140'/>
    <typedef-decl name='setattrofunc' type-id='type-id-190' size-in-bits='64' filepath='./Include/object.h' line='331' column='1' hash='fd7a63c0c6c822c4' id='type-id-148'/>
    <typedef-decl name='setter' type-id='type-id-206' size-in-bits='64' filepath='./Include/descrobject.h' line='9' column='1' hash='fd7a63c0c6c822c4' id='type-id-91'/>
    <typedef-decl name='size_t' type-id='type-id-58' size-in-bits='64' filepath='/usr/lib64/gcc/x86_64-suse-linux/7/include/stddef.h' line='216' column='1' hash='8fdc5eea2983a729' id='type-id-60'/>
    <typedef-decl name='ssize_t' type-id='type-id-185' size-in-bits='64' filepath='/usr/include/stdio.h' line='77' column='1' hash='b119fe0931d2ee10' id='type-id-180'/>
    <typedef-decl name='ssizeargfunc' type-id='type-id-207' size-in-bits='64' filepath='./Include/object.h' line='174' column='1' hash='fd7a63c0c6c822c4' id='type-id-105'/>
    <typedef-decl name='ssizeobjargproc' type-id='type-id-208' size-in-bits='64' filepath='./Include/object.h' line='176' column='1' hash='fd7a63c0c6c822c4' id='type-id-106'/>
    <typedef-decl name='ternaryfunc' type-id='type-id-189' size-in-bits='64' filepath='./Include/object.h' line='171' column='1' hash='fd7a63c0c6c822c4' id='type-id-101'/>
    <typedef-decl name='traverseproc' type-id='type-id-209' size-in-bits='64' filepath='./Include/object.h' line='237' column='1' hash='fd7a63c0c6c822c4' id='type-id-150'/>
    <typedef-decl name='uint32_t' type-id='type-id-186' size-in-bits='32' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-192'/>
    <typedef-decl name='uint64_t' type-id='type-id-187' size-in-bits='64' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-168'/>
    <typedef-decl name='unaryfunc' type-id='type-id-195' size-in-bits='64' filepath='./Include/object.h' line='169' column='1' hash='fd7a63c0c6c822c4' id='type-id-84'/>
    <typedef-decl name='visitproc' type-id='type-id-210' size-in-bits='64' filepath='./Include/object.h' line='236' column='1' hash='fd7a63c0c6c822c4' id='type-id-211'/>
    <union-decl name='_Py_HashSecret_t' naming-typedef-id='type-id-26' visibility='default' size-in-bits='192' filepath='./Include/pyhash.h' line='54' column='1' hash='d18aa9c4d54ccfe1' id='type-id-184'>
      <data-member access='public'>
        <var-decl name='uc' type-id='type-id-212' visibility='default' filepath='./Include/pyhash.h' line='56' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='fnv' type-id='type-id-163' visibility='default' filepath='./Include/pyhash.h' line='61' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='siphash' type-id='type-id-167' visibility='default' filepath='./Include/pyhash.h' line='66' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='djbx33a' type-id='type-id-171' visibility='default' filepath='./Include/pyhash.h' line='71' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='expat' type-id='type-id-169' visibility='default' filepath='./Include/pyhash.h' line='75' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='_gc_head' visibility='default' size-in-bits='192' filepath='./Include/objimpl.h' line='252' column='1' hash='3f6e7c1ef855e1d0' id='type-id-174'>
      <data-member access='public'>
        <var-decl name='gc' type-id='type-id-165' visibility='default' filepath='./Include/objimpl.h' line='257' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='dummy' type-id='type-id-75' visibility='default' filepath='./Include/objimpl.h' line='258' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-213'/>
    <array-type-def dimensions='1' type-id='type-id-213' size-in-bits='128' hash='db96c40792853cfe' id='type-id-170'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-214'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-213' size-in-bits='192' hash='87fcf14d778f9780' id='type-id-212'>
      <subrange length='24' lower-bound='0' upper-bound='23' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='e7b8d3aa178b54e4' id='type-id-215'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-213' size-in-bits='2048' hash='11dd84713e685d57' id='type-id-18'>
      <subrange length='256' lower-bound='0' upper-bound='255' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='5cb16198282e86c6' id='type-id-71'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-56'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-58'/>
    <array-type-def dimensions='1' type-id='type-id-58' size-in-bits='1024' hash='ed1e12a813ec6094' id='type-id-121'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-214'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#4' id='type-id-113'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-33'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' hash='3e37f2b20d5794da' id='type-id-141'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' hash='6a14d50fbfc72aa4' id='type-id-149'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' hash='b5c3055d8ac7abfe' id='type-id-22'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' hash='9fbafc8a9526206e' id='type-id-156'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' hash='0230b2b68ecac17c' id='type-id-133'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' hash='5e74a3d0c690247a' id='type-id-145'/>
    <pointer-type-def type-id='type-id-216' size-in-bits='64' hash='7dae765fb1041f0b' id='type-id-155'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' hash='fa2905a5316cf8d4' id='type-id-154'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='d93fb1e913bf26ac' id='type-id-143'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' hash='f2718b789a023910' id='type-id-6'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-195'/>
    <pointer-type-def type-id='type-id-52' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-173'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-189'/>
    <pointer-type-def type-id='type-id-55' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-204'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-207'/>
    <pointer-type-def type-id='type-id-220' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-193'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-196'/>
    <pointer-type-def type-id='type-id-222' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-183'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-200'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-188'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-125'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' hash='d2938cf7a8037182' id='type-id-144'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' hash='bbcaff58c209e609' id='type-id-27'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' hash='cd8a7bc5f7035255' id='type-id-225'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-197'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-199'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' hash='11e25b7015251b13' id='type-id-53'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-111'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='67db0f314ef1ca33' id='type-id-4'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-177'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' hash='0a10c3c464d14242' id='type-id-166'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' hash='5417bfa2d92068d6' id='type-id-16'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' hash='bfc565ccbd169fac' id='type-id-127'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' hash='bb639d2f393e02bd' id='type-id-128'/>
    <pointer-type-def type-id='type-id-136' size-in-bits='64' hash='a63cdb5c006f1696' id='type-id-131'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-19'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-31'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-36'/>
    <qualified-type-def type-id='type-id-122' const='yes' hash='f7274a687125f274' id='type-id-228'/>
    <pointer-type-def type-id='type-id-228' size-in-bits='64' hash='3a2c96b307a86470' id='type-id-17'/>
    <qualified-type-def type-id='type-id-9' const='yes' hash='3e50fd33f9bb78d9' id='type-id-229'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='c44743f354f6a443' id='type-id-15'/>
    <qualified-type-def type-id='type-id-213' const='yes' hash='645f4d0d44563fc6' id='type-id-70'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-123'/>
    <qualified-type-def type-id='type-id-56' const='yes' hash='6e5b7fbd041269f4' id='type-id-72'/>
    <pointer-type-def type-id='type-id-51' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-198'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-202'/>
    <pointer-type-def type-id='type-id-231' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-201'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-190'/>
    <pointer-type-def type-id='type-id-233' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-206'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-194'/>
    <pointer-type-def type-id='type-id-235' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-208'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-181'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-205'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-209'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-210'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-30'/>
    <pointer-type-def type-id='type-id-239' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-191'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-203'/>
    <pointer-type-def type-id='type-id-241' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-135'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-115'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-116'/>
    <class-decl name='PyMemberDef' is-struct='yes' visibility='default' size-in-bits='320' filepath='./Include/structmember.h' line='18' column='1' hash='2143a59246fb7853' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-19' visibility='default' filepath='./Include/structmember.h' line='19' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-8' visibility='default' filepath='./Include/structmember.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='offset' type-id='type-id-54' visibility='default' filepath='./Include/structmember.h' line='21' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flags' type-id='type-id-8' visibility='default' filepath='./Include/structmember.h' line='22' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='doc' type-id='type-id-19' visibility='default' filepath='./Include/structmember.h' line='23' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-242'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-243'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-244'/>
    <function-decl name='Py_GetBuildInfo' mangled-name='Py_GetBuildInfo' filepath='./Modules/getbuildinfo.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetBuildInfo' hash='53885bde0aa65efe'>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='_Py_gitidentifier' mangled-name='_Py_gitidentifier' filepath='./Modules/getbuildinfo.c' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_gitidentifier' hash='53885bde0aa65efe'>
      <return type-id='type-id-15'/>
    </function-decl>
    <type-decl name='void' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' id='type-id-48'/>
    <function-type size-in-bits='64' hash='8759147de6871040' id='type-id-217'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='a8fa4819a02c2400' id='type-id-218'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='9b79932cbc51c9a6' id='type-id-219'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='6dbdb295a69ac3b3' id='type-id-220'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='8759147de6871040' id='type-id-221'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='780f13718c4d5983' id='type-id-222'>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='833a9c24b4fa04b8' id='type-id-223'>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='9245b516ed12fb75' id='type-id-224'>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-54'/>
      <return type-id='type-id-6'/>
    </function-type>
    <function-type size-in-bits='64' hash='616dbb5e7e171881' id='type-id-226'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-164'/>
    </function-type>
    <function-type size-in-bits='64' hash='616dbb5e7e171881' id='type-id-227'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-54'/>
    </function-type>
    <function-type size-in-bits='64' hash='aad5ba8ee7d4e115' id='type-id-230'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-33'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='c4e1b837fccfe2d0' id='type-id-231'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='63c03439f3e9ae1a' id='type-id-232'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='c4e1b837fccfe2d0' id='type-id-233'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='c7b354fc0c814775' id='type-id-234'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='b4ea4a9949b53d1b' id='type-id-235'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='5aee409ed80f0b7d' id='type-id-236'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-4'/>
      <parameter type-id='type-id-8'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='917d850ef579a1b4' id='type-id-237'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='607077c8457ff8da' id='type-id-238'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-211'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='037d575bc520db4e' id='type-id-239'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' hash='5e83c6cf0c1ff15a' id='type-id-240'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-225'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-241'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-1'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/getpath.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='Py_SetPath' mangled-name='Py_SetPath' filepath='./Modules/getpath.c' line='828' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_SetPath' hash='1116359e91f16ec0'>
      <parameter type-id='type-id-245' name='path' filepath='./Modules/getpath.c' line='828' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='Py_GetPath' mangled-name='Py_GetPath' filepath='./Modules/getpath.c' line='846' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPath' hash='6c67d78c51f3a19c'>
      <return type-id='type-id-246'/>
    </function-decl>
    <function-decl name='Py_GetPrefix' mangled-name='Py_GetPrefix' filepath='./Modules/getpath.c' line='854' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPrefix' hash='6c67d78c51f3a19c'>
      <return type-id='type-id-246'/>
    </function-decl>
    <function-decl name='Py_GetExecPrefix' mangled-name='Py_GetExecPrefix' filepath='./Modules/getpath.c' line='862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetExecPrefix' hash='6c67d78c51f3a19c'>
      <return type-id='type-id-246'/>
    </function-decl>
    <function-decl name='Py_GetProgramFullPath' mangled-name='Py_GetProgramFullPath' filepath='./Modules/getpath.c' line='870' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetProgramFullPath' hash='6c67d78c51f3a19c'>
      <return type-id='type-id-246'/>
    </function-decl>
    <function-decl name='__fprintf_chk' mangled-name='__fprintf_chk' filepath='/usr/include/bits/stdio2-decl.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__fprintf_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__fgets_alias' mangled-name='fgets' filepath='/usr/include/bits/stdio2-decl.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fgets' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__fread_alias' mangled-name='fread' filepath='/usr/include/bits/stdio2-decl.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fread' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__wcscpy_chk' mangled-name='__wcscpy_chk' filepath='/usr/include/bits/wchar2-decl.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__wcscpy_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__wcscpy_alias' mangled-name='wcscpy' filepath='/usr/include/bits/wchar2-decl.h' line='85' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__wcsncpy_alias' mangled-name='wcsncpy' filepath='/usr/include/bits/wchar2-decl.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsncpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__wcscat_chk' mangled-name='__wcscat_chk' filepath='/usr/include/bits/wchar2-decl.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__wcscat_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__wcscat_alias' mangled-name='wcscat' filepath='/usr/include/bits/wchar2-decl.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__wcsncat_alias' mangled-name='wcsncat' filepath='/usr/include/bits/wchar2-decl.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsncat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fseek' mangled-name='fseek' filepath='/usr/include/stdio.h' line='771' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fseek' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='feof' mangled-name='feof' filepath='/usr/include/stdio.h' line='846' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='feof' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='stat' mangled-name='stat64' filepath='/usr/include/sys/stat.h' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='stat64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcscmp' mangled-name='wcscmp' filepath='/usr/include/wchar.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcscmp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcschr' mangled-name='wcschr' filepath='/usr/include/wchar.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcschr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcstok' mangled-name='wcstok' filepath='/usr/include/wchar.h' line='242' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcstok' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/hashtable.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <class-decl name='_Py_hashtable_allocator_t' is-struct='yes' naming-typedef-id='type-id-247' visibility='default' size-in-bits='128' filepath='./Modules/hashtable.h' line='81' column='1' hash='5c083a8d4ae19dd7' id='type-id-248'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='malloc' type-id='type-id-249' visibility='default' filepath='./Modules/hashtable.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='free' type-id='type-id-135' visibility='default' filepath='./Modules/hashtable.h' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_hashtable_entry_t' is-struct='yes' naming-typedef-id='type-id-250' visibility='default' size-in-bits='128' filepath='./Modules/hashtable.h' line='23' column='1' hash='9fc2dcde81d67997' id='type-id-251'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_Py_slist_item' type-id='type-id-252' visibility='default' filepath='./Modules/hashtable.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='key_hash' type-id='type-id-253' visibility='default' filepath='./Modules/hashtable.h' line='27' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_hashtable_t' is-struct='yes' visibility='default' size-in-bits='576' filepath='./Modules/hashtable.h' line='92' column='1' hash='01714c5141d58209' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='num_buckets' type-id='type-id-60' visibility='default' filepath='./Modules/hashtable.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='entries' type-id='type-id-60' visibility='default' filepath='./Modules/hashtable.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='buckets' type-id='type-id-255' visibility='default' filepath='./Modules/hashtable.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='key_size' type-id='type-id-60' visibility='default' filepath='./Modules/hashtable.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='data_size' type-id='type-id-60' visibility='default' filepath='./Modules/hashtable.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='hash_func' type-id='type-id-256' visibility='default' filepath='./Modules/hashtable.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='compare_func' type-id='type-id-257' visibility='default' filepath='./Modules/hashtable.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='alloc' type-id='type-id-247' visibility='default' filepath='./Modules/hashtable.h' line='101' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_slist_item_s' is-struct='yes' visibility='default' size-in-bits='64' filepath='./Modules/hashtable.h' line='8' column='1' hash='8a3e985d2ac2ab6c' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-259' visibility='default' filepath='./Modules/hashtable.h' line='9' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_Py_slist_t' is-struct='yes' naming-typedef-id='type-id-260' visibility='default' size-in-bits='64' filepath='./Modules/hashtable.h' line='12' column='1' hash='89e8ff78fb8031b3' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='head' type-id='type-id-262' visibility='default' filepath='./Modules/hashtable.h' line='13' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='Py_uhash_t' type-id='type-id-60' size-in-bits='64' filepath='./Include/pyport.h' line='96' column='1' hash='8fdc5eea2983a729' id='type-id-253'/>
    <typedef-decl name='_Py_hashtable_allocator_t' type-id='type-id-248' size-in-bits='128' filepath='./Modules/hashtable.h' line='87' column='1' id='type-id-247'/>
    <typedef-decl name='_Py_hashtable_compare_func' type-id='type-id-263' size-in-bits='64' filepath='./Modules/hashtable.h' line='77' column='1' hash='fd7a63c0c6c822c4' id='type-id-257'/>
    <typedef-decl name='_Py_hashtable_entry_t' type-id='type-id-251' size-in-bits='128' filepath='./Modules/hashtable.h' line='30' column='1' id='type-id-250'/>
    <typedef-decl name='_Py_hashtable_foreach_func' type-id='type-id-264' size-in-bits='64' filepath='./Modules/hashtable.h' line='136' column='1' hash='fd7a63c0c6c822c4' id='type-id-265'/>
    <typedef-decl name='_Py_hashtable_hash_func' type-id='type-id-266' size-in-bits='64' filepath='./Modules/hashtable.h' line='75' column='1' hash='fd7a63c0c6c822c4' id='type-id-256'/>
    <typedef-decl name='_Py_hashtable_t' type-id='type-id-254' size-in-bits='576' filepath='./Modules/hashtable.h' line='102' column='1' id='type-id-267'/>
    <typedef-decl name='_Py_slist_item_t' type-id='type-id-258' size-in-bits='64' filepath='./Modules/hashtable.h' line='10' column='1' id='type-id-252'/>
    <typedef-decl name='_Py_slist_t' type-id='type-id-261' size-in-bits='64' filepath='./Modules/hashtable.h' line='14' column='1' id='type-id-260'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-266'/>
    <pointer-type-def type-id='type-id-247' size-in-bits='64' hash='b03d96946c06e2aa' id='type-id-269'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' hash='f521aaa48ccac67d' id='type-id-270'/>
    <pointer-type-def type-id='type-id-254' size-in-bits='64' hash='37d2d6c139a4516a' id='type-id-271'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' hash='37d2d6c139a4516a#2' id='type-id-272'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' hash='c94400888393bae5' id='type-id-259'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' hash='48f0589ca0995f85' id='type-id-262'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' hash='372e2272ef63b2f7' id='type-id-255'/>
    <qualified-type-def type-id='type-id-250' const='yes' hash='ed395f29cb376b8f' id='type-id-273'/>
    <pointer-type-def type-id='type-id-273' size-in-bits='64' hash='5a7a048fd9ac566b' id='type-id-274'/>
    <pointer-type-def type-id='type-id-275' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-264'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-263'/>
    <pointer-type-def type-id='type-id-277' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-249'/>
    <function-decl name='_Py_hashtable_hash_ptr' mangled-name='_Py_hashtable_hash_ptr' filepath='./Modules/hashtable.c' line='108' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_hash_ptr' hash='f9b2ada6e5a804de'>
      <parameter type-id='type-id-271'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-253'/>
    </function-decl>
    <function-decl name='_Py_hashtable_compare_direct' mangled-name='_Py_hashtable_compare_direct' filepath='./Modules/hashtable.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_compare_direct' hash='d0a5b77eb7aac173#2'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='118' column='1'/>
      <parameter type-id='type-id-48' name='pkey' filepath='./Modules/hashtable.c' line='118' column='1'/>
      <parameter type-id='type-id-274' name='entry' filepath='./Modules/hashtable.c' line='119' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new_full' mangled-name='_Py_hashtable_new_full' filepath='./Modules/hashtable.c' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new_full' hash='5745986c44ce9499'>
      <parameter type-id='type-id-60' name='key_size' filepath='./Modules/hashtable.c' line='141' column='1'/>
      <parameter type-id='type-id-60' name='data_size' filepath='./Modules/hashtable.c' line='141' column='1'/>
      <parameter type-id='type-id-60' name='init_size' filepath='./Modules/hashtable.c' line='142' column='1'/>
      <parameter type-id='type-id-256' name='hash_func' filepath='./Modules/hashtable.c' line='143' column='1'/>
      <parameter type-id='type-id-257' name='compare_func' filepath='./Modules/hashtable.c' line='144' column='1'/>
      <parameter type-id='type-id-269' name='allocator' filepath='./Modules/hashtable.c' line='145' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
    <function-decl name='_Py_hashtable_new' mangled-name='_Py_hashtable_new' filepath='./Modules/hashtable.c' line='183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_new' hash='8e4ef12c82b5daaa'>
      <parameter type-id='type-id-60' name='key_size' filepath='./Modules/hashtable.c' line='183' column='1'/>
      <parameter type-id='type-id-60' name='data_size' filepath='./Modules/hashtable.c' line='183' column='1'/>
      <parameter type-id='type-id-256' name='hash_func' filepath='./Modules/hashtable.c' line='184' column='1'/>
      <parameter type-id='type-id-257' name='compare_func' filepath='./Modules/hashtable.c' line='185' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
    <function-decl name='_Py_hashtable_size' mangled-name='_Py_hashtable_size' filepath='./Modules/hashtable.c' line='195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_size' hash='f9b2ada6e5a804de'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='195' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get_entry' mangled-name='_Py_hashtable_get_entry' filepath='./Modules/hashtable.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get_entry' hash='d9f512d922ef73f8'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='253' column='1'/>
      <parameter type-id='type-id-60' name='key_size' filepath='./Modules/hashtable.c' line='254' column='1'/>
      <parameter type-id='type-id-48' name='pkey' filepath='./Modules/hashtable.c' line='254' column='1'/>
      <return type-id='type-id-270'/>
    </function-decl>
    <function-decl name='_Py_hashtable_set' mangled-name='_Py_hashtable_set' filepath='./Modules/hashtable.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_set' hash='3692f45987bff843'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-60' name='key_size' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-48' name='pkey' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-60' name='data_size' filepath='./Modules/hashtable.c' line='371' column='1'/>
      <parameter type-id='type-id-48' name='data' filepath='./Modules/hashtable.c' line='371' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_hashtable_get' mangled-name='_Py_hashtable_get' filepath='./Modules/hashtable.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_get' hash='3692f45987bff843'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-60' name='key_size' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-48' name='pkey' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-60' name='data_size' filepath='./Modules/hashtable.c' line='371' column='1'/>
      <parameter type-id='type-id-48' name='data' filepath='./Modules/hashtable.c' line='371' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_hashtable_pop' mangled-name='_Py_hashtable_pop' filepath='./Modules/hashtable.c' line='370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_pop' hash='3692f45987bff843'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-60' name='key_size' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-48' name='pkey' filepath='./Modules/hashtable.c' line='370' column='1'/>
      <parameter type-id='type-id-60' name='data_size' filepath='./Modules/hashtable.c' line='371' column='1'/>
      <parameter type-id='type-id-48' name='data' filepath='./Modules/hashtable.c' line='371' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_hashtable_foreach' mangled-name='_Py_hashtable_foreach' filepath='./Modules/hashtable.c' line='394' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_foreach' hash='b4d059e918a92b3f'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='394' column='1'/>
      <parameter type-id='type-id-265' name='func' filepath='./Modules/hashtable.c' line='395' column='1'/>
      <parameter type-id='type-id-48' name='arg' filepath='./Modules/hashtable.c' line='396' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_hashtable_clear' mangled-name='_Py_hashtable_clear' filepath='./Modules/hashtable.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_clear' hash='57f4e0cb2200c44c'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='475' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_hashtable_destroy' mangled-name='_Py_hashtable_destroy' filepath='./Modules/hashtable.c' line='475' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_destroy' hash='57f4e0cb2200c44c'>
      <parameter type-id='type-id-272' name='ht' filepath='./Modules/hashtable.c' line='475' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_hashtable_copy' mangled-name='_Py_hashtable_copy' filepath='./Modules/hashtable.c' line='494' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_hashtable_copy' hash='71672a524d3378c7'>
      <parameter type-id='type-id-272' name='src' filepath='./Modules/hashtable.c' line='494' column='1'/>
      <return type-id='type-id-272'/>
    </function-decl>
    <function-type size-in-bits='64' hash='f9b2ada6e5a804de' id='type-id-268'>
      <parameter type-id='type-id-271'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-253'/>
    </function-type>
    <function-type size-in-bits='64' hash='d49ee583063edc2f' id='type-id-275'>
      <parameter type-id='type-id-272'/>
      <parameter type-id='type-id-270'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='d0a5b77eb7aac173' id='type-id-276'>
      <parameter type-id='type-id-271'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-274'/>
      <return type-id='type-id-8'/>
    </function-type>
    <function-type size-in-bits='64' hash='e0055d99adb0e173' id='type-id-277'>
      <parameter type-id='type-id-60'/>
      <return type-id='type-id-48'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/itertoolsmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_itertools' mangled-name='PyInit_itertools' filepath='./Modules/itertoolsmodule.c' line='4632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_itertools' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/posixmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <typedef-decl name='uid_t' type-id='type-id-278' size-in-bits='32' filepath='/usr/include/sys/types.h' line='79' column='1' hash='e66b43f97c38e87a' id='type-id-279'/>
    <function-decl name='__builtin_strcpy' mangled-name='strcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyLong_FromUid' mangled-name='_PyLong_FromUid' filepath='./Modules/posixmodule.c' line='421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyLong_FromUid' hash='45145aeba9822373'>
      <parameter type-id='type-id-279' name='uid' filepath='./Modules/posixmodule.c' line='421' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_Py_Uid_Converter' mangled-name='_Py_Uid_Converter' filepath='./Modules/posixmodule.c' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Uid_Converter' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='obj' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <parameter type-id='type-id-48' name='result' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_Py_Gid_Converter' mangled-name='_Py_Gid_Converter' filepath='./Modules/posixmodule.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_Gid_Converter' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='obj' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <parameter type-id='type-id-48' name='result' filepath='./Modules/_io/_iomodule.c' line='547' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyOS_FSPath' mangled-name='PyOS_FSPath' filepath='./Modules/posixmodule.c' line='12119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FSPath' hash='8759147de6871040'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyInit_posix' mangled-name='PyInit_posix' filepath='./Modules/posixmodule.c' line='13037' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_posix' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='__sched_cpucount' mangled-name='__sched_cpucount' filepath='/usr/include/bits/cpu-set.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpucount' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__sched_cpualloc' mangled-name='__sched_cpualloc' filepath='/usr/include/bits/cpu-set.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpualloc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__sched_cpufree' mangled-name='__sched_cpufree' filepath='/usr/include/bits/cpu-set.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__sched_cpufree' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__openat_alias' mangled-name='openat64' filepath='/usr/include/bits/fcntl2.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openat64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__pread64_alias' mangled-name='pread64' filepath='/usr/include/bits/unistd-decl.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pread64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__readlink_alias' mangled-name='readlink' filepath='/usr/include/bits/unistd-decl.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlink' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__readlinkat_alias' mangled-name='readlinkat' filepath='/usr/include/bits/unistd-decl.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readlinkat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__getcwd_alias' mangled-name='getcwd' filepath='/usr/include/bits/unistd-decl.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getcwd' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__confstr_alias' mangled-name='confstr' filepath='/usr/include/bits/unistd-decl.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='confstr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__getgroups_alias' mangled-name='getgroups' filepath='/usr/include/bits/unistd-decl.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgroups' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='closedir' mangled-name='closedir' filepath='/usr/include/dirent.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='closedir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='opendir' mangled-name='opendir' filepath='/usr/include/dirent.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='opendir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fdopendir' mangled-name='fdopendir' filepath='/usr/include/dirent.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fdopendir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='readdir' mangled-name='readdir64' filepath='/usr/include/dirent.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readdir64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rewinddir' mangled-name='rewinddir' filepath='/usr/include/dirent.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rewinddir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='posix_fadvise' mangled-name='posix_fadvise64' filepath='/usr/include/fcntl.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_fadvise64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='posix_fallocate' mangled-name='posix_fallocate64' filepath='/usr/include/fcntl.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='posix_fallocate64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setgroups' mangled-name='setgroups' filepath='/usr/include/grp.h' line='180' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setgroups' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getgrouplist' mangled-name='getgrouplist' filepath='/usr/include/grp.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgrouplist' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='initgroups' mangled-name='initgroups' filepath='/usr/include/grp.h' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='initgroups' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='openpty' mangled-name='openpty' filepath='/usr/include/pty.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openpty' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='forkpty' mangled-name='forkpty' filepath='/usr/include/pty.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='forkpty' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_setparam' mangled-name='sched_setparam' filepath='/usr/include/sched.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setparam' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_getparam' mangled-name='sched_getparam' filepath='/usr/include/sched.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getparam' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_setscheduler' mangled-name='sched_setscheduler' filepath='/usr/include/sched.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setscheduler' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_getscheduler' mangled-name='sched_getscheduler' filepath='/usr/include/sched.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getscheduler' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_yield' mangled-name='sched_yield' filepath='/usr/include/sched.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_yield' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_get_priority_max' mangled-name='sched_get_priority_max' filepath='/usr/include/sched.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_get_priority_max' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_get_priority_min' mangled-name='sched_get_priority_min' filepath='/usr/include/sched.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_get_priority_min' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_rr_get_interval' mangled-name='sched_rr_get_interval' filepath='/usr/include/sched.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_rr_get_interval' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_setaffinity' mangled-name='sched_setaffinity' filepath='/usr/include/sched.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_setaffinity' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sched_getaffinity' mangled-name='sched_getaffinity' filepath='/usr/include/sched.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sched_getaffinity' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='kill' mangled-name='kill' filepath='/usr/include/signal.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='kill' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='killpg' mangled-name='killpg' filepath='/usr/include/signal.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='killpg' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rename' mangled-name='rename' filepath='/usr/include/stdio.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rename' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='renameat' mangled-name='renameat' filepath='/usr/include/stdio.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='renameat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fileno' mangled-name='fileno' filepath='/usr/include/stdio.h' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fileno' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ctermid' mangled-name='ctermid' filepath='/usr/include/stdio.h' line='895' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ctermid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='putenv' mangled-name='putenv' filepath='/usr/include/stdlib.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='putenv' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='unsetenv' mangled-name='unsetenv' filepath='/usr/include/stdlib.h' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unsetenv' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='system' mangled-name='system' filepath='/usr/include/stdlib.h' line='923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='system' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='qsort' mangled-name='qsort' filepath='/usr/include/stdlib.h' line='970' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='qsort' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getloadavg' mangled-name='getloadavg' filepath='/usr/include/stdlib.h' line='1145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getloadavg' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strerror' mangled-name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strerror' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ioctl' mangled-name='ioctl' filepath='/usr/include/sys/ioctl.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ioctl' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpriority' mangled-name='getpriority' filepath='/usr/include/sys/resource.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpriority' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setpriority' mangled-name='setpriority' filepath='/usr/include/sys/resource.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpriority' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sendfile' mangled-name='sendfile64' filepath='/usr/include/sys/sendfile.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sendfile64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fstat' mangled-name='fstat64' filepath='/usr/include/sys/stat.h' line='230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstat64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fstatat' mangled-name='fstatat64' filepath='/usr/include/sys/stat.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstatat64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lstat' mangled-name='lstat64' filepath='/usr/include/sys/stat.h' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lstat64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='chmod' mangled-name='chmod' filepath='/usr/include/sys/stat.h' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chmod' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fchmod' mangled-name='fchmod' filepath='/usr/include/sys/stat.h' line='365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchmod' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fchmodat' mangled-name='fchmodat' filepath='/usr/include/sys/stat.h' line='371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchmodat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='umask' mangled-name='umask' filepath='/usr/include/sys/stat.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='umask' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mkdir' mangled-name='mkdir' filepath='/usr/include/sys/stat.h' line='389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mkdirat' mangled-name='mkdirat' filepath='/usr/include/sys/stat.h' line='396' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkdirat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mknod' mangled-name='mknod' filepath='/usr/include/sys/stat.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mknod' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mknodat' mangled-name='mknodat' filepath='/usr/include/sys/stat.h' line='411' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mknodat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mkfifo' mangled-name='mkfifo' filepath='/usr/include/sys/stat.h' line='418' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkfifo' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mkfifoat' mangled-name='mkfifoat' filepath='/usr/include/sys/stat.h' line='425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mkfifoat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='utimensat' mangled-name='utimensat' filepath='/usr/include/sys/stat.h' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='utimensat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='futimens' mangled-name='futimens' filepath='/usr/include/sys/stat.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='futimens' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='statvfs' mangled-name='statvfs64' filepath='/usr/include/sys/statvfs.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='statvfs64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fstatvfs' mangled-name='fstatvfs64' filepath='/usr/include/sys/statvfs.h' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fstatvfs64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='times' mangled-name='times' filepath='/usr/include/sys/times.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='times' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='readv' mangled-name='readv' filepath='/usr/include/sys/uio.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='readv' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='writev' mangled-name='writev' filepath='/usr/include/sys/uio.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='writev' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='uname' mangled-name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wait' mangled-name='wait' filepath='/usr/include/sys/wait.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='waitpid' mangled-name='waitpid' filepath='/usr/include/sys/wait.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='waitpid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='waitid' mangled-name='waitid' filepath='/usr/include/sys/wait.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='waitid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wait3' mangled-name='wait3' filepath='/usr/include/sys/wait.h' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait3' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wait4' mangled-name='wait4' filepath='/usr/include/sys/wait.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wait4' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setxattr' mangled-name='setxattr' filepath='/usr/include/sys/xattr.h' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lsetxattr' mangled-name='lsetxattr' filepath='/usr/include/sys/xattr.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lsetxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fsetxattr' mangled-name='fsetxattr' filepath='/usr/include/sys/xattr.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fsetxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getxattr' mangled-name='getxattr' filepath='/usr/include/sys/xattr.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lgetxattr' mangled-name='lgetxattr' filepath='/usr/include/sys/xattr.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lgetxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fgetxattr' mangled-name='fgetxattr' filepath='/usr/include/sys/xattr.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fgetxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='listxattr' mangled-name='listxattr' filepath='/usr/include/sys/xattr.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='listxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='llistxattr' mangled-name='llistxattr' filepath='/usr/include/sys/xattr.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='llistxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='flistxattr' mangled-name='flistxattr' filepath='/usr/include/sys/xattr.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='flistxattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='removexattr' mangled-name='removexattr' filepath='/usr/include/sys/xattr.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='removexattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lremovexattr' mangled-name='lremovexattr' filepath='/usr/include/sys/xattr.h' line='101' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lremovexattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fremovexattr' mangled-name='fremovexattr' filepath='/usr/include/sys/xattr.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fremovexattr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='access' mangled-name='access' filepath='/usr/include/unistd.h' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='access' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='faccessat' mangled-name='faccessat' filepath='/usr/include/unistd.h' line='309' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='faccessat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pwrite' mangled-name='pwrite64' filepath='/usr/include/unistd.h' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pwrite64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pipe' mangled-name='pipe' filepath='/usr/include/unistd.h' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pipe' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pipe2' mangled-name='pipe2' filepath='/usr/include/unistd.h' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pipe2' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='chown' mangled-name='chown' filepath='/usr/include/unistd.h' line='493' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chown' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fchown' mangled-name='fchown' filepath='/usr/include/unistd.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchown' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lchown' mangled-name='lchown' filepath='/usr/include/unistd.h' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lchown' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fchownat' mangled-name='fchownat' filepath='/usr/include/unistd.h' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchownat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='chdir' mangled-name='chdir' filepath='/usr/include/unistd.h' line='517' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chdir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fchdir' mangled-name='fchdir' filepath='/usr/include/unistd.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fchdir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dup2' mangled-name='dup2' filepath='/usr/include/unistd.h' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dup2' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dup3' mangled-name='dup3' filepath='/usr/include/unistd.h' line='560' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dup3' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='execve' mangled-name='execve' filepath='/usr/include/unistd.h' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='execve' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fexecve' mangled-name='fexecve' filepath='/usr/include/unistd.h' line='578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fexecve' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='execv' mangled-name='execv' filepath='/usr/include/unistd.h' line='584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='execv' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='nice' mangled-name='nice' filepath='/usr/include/unistd.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nice' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pathconf' mangled-name='pathconf' filepath='/usr/include/unistd.h' line='633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pathconf' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fpathconf' mangled-name='fpathconf' filepath='/usr/include/unistd.h' line='637' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fpathconf' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpid' mangled-name='getpid' filepath='/usr/include/unistd.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getppid' mangled-name='getppid' filepath='/usr/include/unistd.h' line='653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getppid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpgrp' mangled-name='getpgrp' filepath='/usr/include/unistd.h' line='656' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpgrp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpgid' mangled-name='getpgid' filepath='/usr/include/unistd.h' line='661' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpgid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setpgid' mangled-name='setpgid' filepath='/usr/include/unistd.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpgid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setpgrp' mangled-name='setpgrp' filepath='/usr/include/unistd.h' line='682' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpgrp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setsid' mangled-name='setsid' filepath='/usr/include/unistd.h' line='689' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setsid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getsid' mangled-name='getsid' filepath='/usr/include/unistd.h' line='693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getsid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getuid' mangled-name='getuid' filepath='/usr/include/unistd.h' line='697' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='geteuid' mangled-name='geteuid' filepath='/usr/include/unistd.h' line='700' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='geteuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getgid' mangled-name='getgid' filepath='/usr/include/unistd.h' line='703' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getgid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getegid' mangled-name='getegid' filepath='/usr/include/unistd.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getegid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setuid' mangled-name='setuid' filepath='/usr/include/unistd.h' line='722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setreuid' mangled-name='setreuid' filepath='/usr/include/unistd.h' line='727' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setreuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='seteuid' mangled-name='seteuid' filepath='/usr/include/unistd.h' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='seteuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setgid' mangled-name='setgid' filepath='/usr/include/unistd.h' line='739' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setgid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setregid' mangled-name='setregid' filepath='/usr/include/unistd.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setregid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setegid' mangled-name='setegid' filepath='/usr/include/unistd.h' line='749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setegid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getresuid' mangled-name='getresuid' filepath='/usr/include/unistd.h' line='755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getresuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getresgid' mangled-name='getresgid' filepath='/usr/include/unistd.h' line='760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getresgid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setresuid' mangled-name='setresuid' filepath='/usr/include/unistd.h' line='765' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setresuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setresgid' mangled-name='setresgid' filepath='/usr/include/unistd.h' line='770' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setresgid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fork' mangled-name='fork' filepath='/usr/include/unistd.h' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fork' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ttyname' mangled-name='ttyname' filepath='/usr/include/unistd.h' line='799' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ttyname' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='link' mangled-name='link' filepath='/usr/include/unistd.h' line='819' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='link' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='linkat' mangled-name='linkat' filepath='/usr/include/unistd.h' line='825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='linkat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='symlink' mangled-name='symlink' filepath='/usr/include/unistd.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='symlink' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='symlinkat' mangled-name='symlinkat' filepath='/usr/include/unistd.h' line='847' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='symlinkat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='unlink' mangled-name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlink' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='unlinkat' mangled-name='unlinkat' filepath='/usr/include/unistd.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlinkat' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rmdir' mangled-name='rmdir' filepath='/usr/include/unistd.h' line='867' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rmdir' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tcgetpgrp' mangled-name='tcgetpgrp' filepath='/usr/include/unistd.h' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tcgetpgrp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tcsetpgrp' mangled-name='tcsetpgrp' filepath='/usr/include/unistd.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tcsetpgrp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getlogin' mangled-name='getlogin' filepath='/usr/include/unistd.h' line='881' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getlogin' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='chroot' mangled-name='chroot' filepath='/usr/include/unistd.h' line='977' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='chroot' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sync' mangled-name='sync' filepath='/usr/include/unistd.h' line='1005' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sync' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='truncate' mangled-name='truncate64' filepath='/usr/include/unistd.h' line='1030' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='truncate64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='syscall' mangled-name='syscall' filepath='/usr/include/unistd.h' line='1091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='syscall' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='lockf' mangled-name='lockf64' filepath='/usr/include/unistd.h' line='1117' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='lockf64' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/pwdmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_pwd' mangled-name='PyInit_pwd' filepath='./Modules/pwdmodule.c' line='231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_pwd' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='setpwent' mangled-name='setpwent' filepath='/usr/include/pwd.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setpwent' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='endpwent' mangled-name='endpwent' filepath='/usr/include/pwd.h' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='endpwent' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpwent' mangled-name='getpwent' filepath='/usr/include/pwd.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwent' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpwuid' mangled-name='getpwuid' filepath='/usr/include/pwd.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwuid' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getpwnam' mangled-name='getpwnam' filepath='/usr/include/pwd.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpwnam' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/signalmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='__builtin_floor' mangled-name='floor' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='floor' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySignal_SetWakeupFd' mangled-name='PySignal_SetWakeupFd' filepath='./Modules/signalmodule.c' line='673' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySignal_SetWakeupFd' hash='d628501fd2223339'>
      <parameter type-id='type-id-8' name='fd' filepath='./Modules/signalmodule.c' line='673' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyInit__signal' mangled-name='PyInit__signal' filepath='./Modules/signalmodule.c' line='1220' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__signal' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyErr_CheckSignals' mangled-name='PyErr_CheckSignals' filepath='./Modules/signalmodule.c' line='1520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_CheckSignals' hash='388da3fa973fde78'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyErr_SetInterrupt' mangled-name='PyErr_SetInterrupt' filepath='./Modules/signalmodule.c' line='1582' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyErr_SetInterrupt' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyOS_InitInterrupts' mangled-name='PyOS_InitInterrupts' filepath='./Modules/signalmodule.c' line='1591' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InitInterrupts' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyOS_FiniInterrupts' mangled-name='PyOS_FiniInterrupts' filepath='./Modules/signalmodule.c' line='1600' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_FiniInterrupts' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyOS_InterruptOccurred' mangled-name='PyOS_InterruptOccurred' filepath='./Modules/signalmodule.c' line='1606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_InterruptOccurred' hash='388da3fa973fde78'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyOS_AfterFork' mangled-name='PyOS_AfterFork' filepath='./Modules/signalmodule.c' line='1632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyOS_AfterFork' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyOS_IsMainThread' mangled-name='_PyOS_IsMainThread' filepath='./Modules/signalmodule.c' line='1651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyOS_IsMainThread' hash='388da3fa973fde78'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fmod' mangled-name='fmod' filepath='/usr/include/bits/mathcalls.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fmod@@GLIBC_2.38' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pthread_kill' mangled-name='pthread_kill' filepath='/usr/include/bits/sigthread.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_kill' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigaddset' mangled-name='sigaddset' filepath='/usr/include/signal.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigaddset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigismember' mangled-name='sigismember' filepath='/usr/include/signal.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigismember' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigpending' mangled-name='sigpending' filepath='/usr/include/signal.h' line='247' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigpending' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigwait' mangled-name='sigwait' filepath='/usr/include/signal.h' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigwait' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigwaitinfo' mangled-name='sigwaitinfo' filepath='/usr/include/signal.h' line='264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigwaitinfo' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='sigtimedwait' mangled-name='sigtimedwait' filepath='/usr/include/signal.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sigtimedwait' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmin' mangled-name='__libc_current_sigrtmin' filepath='/usr/include/signal.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_current_sigrtmin' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='__libc_current_sigrtmax' mangled-name='__libc_current_sigrtmax' filepath='/usr/include/signal.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__libc_current_sigrtmax' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='getitimer' mangled-name='getitimer' filepath='/usr/include/sys/time.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getitimer' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setitimer' mangled-name='setitimer' filepath='/usr/include/sys/time.h' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setitimer' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='alarm' mangled-name='alarm' filepath='/usr/include/unistd.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='alarm' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='pause' mangled-name='pause' filepath='/usr/include/unistd.h' line='489' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pause' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/symtablemodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <var-decl name='PySTEntry_Type' type-id='type-id-12' visibility='default' filepath='./Include/symtable.h' line='67' column='1'/>
    <function-decl name='PyInit__symtable' mangled-name='PyInit__symtable' filepath='./Modules/symtablemodule.c' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit__symtable' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/timemodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyInit_time' mangled-name='PyInit_time' filepath='./Modules/timemodule.c' line='1376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_time' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='getrusage' mangled-name='getrusage' filepath='/usr/include/sys/resource.h' line='89' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getrusage' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='select' mangled-name='select' filepath='/usr/include/sys/select.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='select' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='clock' mangled-name='clock' filepath='/usr/include/time.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='time' mangled-name='time' filepath='/usr/include/time.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='time' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='mktime' mangled-name='mktime' filepath='/usr/include/time.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mktime' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='tzset' mangled-name='tzset' filepath='/usr/include/time.h' line='229' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tzset' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='clock_getres' mangled-name='clock_getres' filepath='/usr/include/time.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_getres' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='clock_gettime' mangled-name='clock_gettime' filepath='/usr/include/time.h' line='289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_gettime' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='clock_settime' mangled-name='clock_settime' filepath='/usr/include/time.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_settime' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcsftime' mangled-name='wcsftime' filepath='/usr/include/wchar.h' line='1043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsftime' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/xxsubtype.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_xxsubtype' mangled-name='PyInit_xxsubtype' filepath='./Modules/xxsubtype.c' line='311' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_xxsubtype' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Modules/zipimport.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_zipimport' mangled-name='PyInit_zipimport' filepath='./Modules/zipimport.c' line='1551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_zipimport' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='getc' mangled-name='getc' filepath='/usr/include/stdio.h' line='572' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ftell' mangled-name='ftell' filepath='/usr/include/stdio.h' line='776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ftell' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ferror' mangled-name='ferror' filepath='/usr/include/stdio.h' line='848' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ferror' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/dynload_shlib.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-15' size-in-bits='256' hash='57830adbeb7593e3' id='type-id-280'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-281'/>
    </array-type-def>
    <typedef-decl name='dl_funcptr' type-id='type-id-282' size-in-bits='64' filepath='./Python/importdl.h' line='20' column='1' hash='fd7a63c0c6c822c4' id='type-id-283'/>
    <var-decl name='_PyImport_DynLoadFiletab' type-id='type-id-280' mangled-name='_PyImport_DynLoadFiletab' visibility='default' filepath='./Python/dynload_shlib.c' line='35' column='1' elf-symbol-id='_PyImport_DynLoadFiletab'/>
    <function-decl name='_PyImport_FindSharedFuncptr' mangled-name='_PyImport_FindSharedFuncptr' filepath='./Python/dynload_shlib.c' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyImport_FindSharedFuncptr' hash='2c87bb323e763f1a'>
      <parameter type-id='type-id-15' name='prefix' filepath='./Python/dynload_shlib.c' line='55' column='1'/>
      <parameter type-id='type-id-15' name='shortname' filepath='./Python/dynload_shlib.c' line='56' column='1'/>
      <parameter type-id='type-id-15' name='pathname' filepath='./Python/dynload_shlib.c' line='57' column='1'/>
      <parameter type-id='type-id-33' name='fp' filepath='./Python/dynload_shlib.c' line='57' column='1'/>
      <return type-id='type-id-283'/>
    </function-decl>
    <var-decl name='_PyImport_DynLoadFiletab' type-id='type-id-284' visibility='default' filepath='./Python/importdl.h' line='9' column='1'/>
    <function-decl name='dlopen' mangled-name='dlopen' filepath='/usr/include/dlfcn.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlopen' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dlsym' mangled-name='dlsym' filepath='/usr/include/dlfcn.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlsym' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='dlerror' mangled-name='dlerror' filepath='/usr/include/dlfcn.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dlerror' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/getcompiler.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='Py_GetCompiler' mangled-name='Py_GetCompiler' filepath='./Python/getcompiler.c' line='25' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetCompiler' hash='53885bde0aa65efe'>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/getplatform.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='Py_GetPlatform' mangled-name='Py_GetPlatform' filepath='./Python/getplatform.c' line='9' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetPlatform' hash='53885bde0aa65efe'>
      <return type-id='type-id-15'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/importdl.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='_PyImport_LoadDynamicModuleWithSpec' mangled-name='_PyImport_LoadDynamicModuleWithSpec' filepath='./Python/importdl.c' line='90' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyImport_LoadDynamicModuleWithSpec' hash='bf5bd7211d4bb3c4'>
      <parameter type-id='type-id-6' name='spec' filepath='./Python/importdl.c' line='90' column='1'/>
      <parameter type-id='type-id-33' name='fp' filepath='./Python/importdl.c' line='90' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='./Python/sysmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' hash='8406b5c61a5154ba' id='type-id-285'/>
    <function-decl name='__builtin_fwrite' mangled-name='fwrite' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fwrite' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PySys_GetObjectId' mangled-name='_PySys_GetObjectId' filepath='./Python/sysmodule.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetObjectId' hash='3b61e20dcf8d025a'>
      <parameter type-id='type-id-286' name='key' filepath='./Python/sysmodule.c' line='51' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PySys_GetObject' mangled-name='PySys_GetObject' filepath='./Python/sysmodule.c' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetObject' hash='65b6095a7d5e0231'>
      <parameter type-id='type-id-15' name='name' filepath='./Python/sysmodule.c' line='61' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PySys_SetObjectId' mangled-name='_PySys_SetObjectId' filepath='./Python/sysmodule.c' line='71' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_SetObjectId' hash='22aaeb6dd63f2165'>
      <parameter type-id='type-id-286' name='key' filepath='./Python/sysmodule.c' line='71' column='1'/>
      <parameter type-id='type-id-6' name='v' filepath='./Python/sysmodule.c' line='71' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySys_SetObject' mangled-name='PySys_SetObject' filepath='./Python/sysmodule.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetObject' hash='258b661d16198aff'>
      <parameter type-id='type-id-15' name='name' filepath='./Python/sysmodule.c' line='86' column='1'/>
      <parameter type-id='type-id-6' name='v' filepath='./Python/sysmodule.c' line='86' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='_PySys_GetSizeOf' mangled-name='_PySys_GetSizeOf' filepath='./Python/sysmodule.c' line='1123' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_GetSizeOf' hash='243368eaa45734f1'>
      <parameter type-id='type-id-6' name='o' filepath='./Python/sysmodule.c' line='1123' column='1'/>
      <return type-id='type-id-60'/>
    </function-decl>
    <function-decl name='PySys_ResetWarnOptions' mangled-name='PySys_ResetWarnOptions' filepath='./Python/sysmodule.c' line='1512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_ResetWarnOptions' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOptionUnicode' mangled-name='PySys_AddWarnOptionUnicode' filepath='./Python/sysmodule.c' line='1520' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOptionUnicode' hash='037d575bc520db4e'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_AddWarnOption' mangled-name='PySys_AddWarnOption' filepath='./Python/sysmodule.c' line='1532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddWarnOption' hash='1116359e91f16ec0'>
      <parameter type-id='type-id-245' name='path' filepath='./Modules/getpath.c' line='828' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_HasWarnOptions' mangled-name='PySys_HasWarnOptions' filepath='./Python/sysmodule.c' line='1543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_HasWarnOptions' hash='388da3fa973fde78'>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PySys_AddXOption' mangled-name='PySys_AddXOption' filepath='./Python/sysmodule.c' line='1561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_AddXOption' hash='1116359e91f16ec0'>
      <parameter type-id='type-id-245' name='path' filepath='./Modules/getpath.c' line='828' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_GetXOptions' mangled-name='PySys_GetXOptions' filepath='./Python/sysmodule.c' line='1597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_GetXOptions' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <var-decl name='_PySys_ImplName' type-id='type-id-15' mangled-name='_PySys_ImplName' visibility='default' filepath='./Python/sysmodule.c' line='1846' column='1' elf-symbol-id='_PySys_ImplName'/>
    <var-decl name='_PySys_ImplCacheTag' type-id='type-id-15' mangled-name='_PySys_ImplCacheTag' visibility='default' filepath='./Python/sysmodule.c' line='1850' column='1' elf-symbol-id='_PySys_ImplCacheTag'/>
    <function-decl name='_PySys_Init' mangled-name='_PySys_Init' filepath='./Python/sysmodule.c' line='1930' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PySys_Init' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PySys_SetPath' mangled-name='PySys_SetPath' filepath='./Python/sysmodule.c' line='2165' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetPath' hash='1116359e91f16ec0'>
      <parameter type-id='type-id-245' name='path' filepath='./Modules/getpath.c' line='828' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_SetArgvEx' mangled-name='PySys_SetArgvEx' filepath='./Python/sysmodule.c' line='2306' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgvEx' hash='bdd8dbc2bfd729da'>
      <parameter type-id='type-id-8' name='argc' filepath='./Python/sysmodule.c' line='2306' column='1'/>
      <parameter type-id='type-id-285' name='argv' filepath='./Python/sysmodule.c' line='2306' column='1'/>
      <parameter type-id='type-id-8' name='updatepath' filepath='./Python/sysmodule.c' line='2306' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_SetArgv' mangled-name='PySys_SetArgv' filepath='./Python/sysmodule.c' line='2319' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_SetArgv' hash='207dd5f9cde56c6e'>
      <parameter type-id='type-id-8' name='argc' filepath='./Python/sysmodule.c' line='2319' column='1'/>
      <parameter type-id='type-id-285' name='argv' filepath='./Python/sysmodule.c' line='2319' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_WriteStdout' mangled-name='PySys_WriteStdout' filepath='./Python/sysmodule.c' line='2426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStdout' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-15' name='format' filepath='./Python/sysmodule.c' line='2478' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_WriteStderr' mangled-name='PySys_WriteStderr' filepath='./Python/sysmodule.c' line='2436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_WriteStderr' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-15' name='format' filepath='./Python/sysmodule.c' line='2478' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_FormatStdout' mangled-name='PySys_FormatStdout' filepath='./Python/sysmodule.c' line='2468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStdout' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-15' name='format' filepath='./Python/sysmodule.c' line='2478' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PySys_FormatStderr' mangled-name='PySys_FormatStderr' filepath='./Python/sysmodule.c' line='2478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PySys_FormatStderr' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-15' name='format' filepath='./Python/sysmodule.c' line='2478' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fputc' mangled-name='fputc' filepath='/usr/include/stdio.h' line='607' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fputs' mangled-name='fputs' filepath='/usr/include/stdio.h' line='713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fputs' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='exit' mangled-name='exit' filepath='/usr/include/stdlib.h' line='756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='exit' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='wcsrchr' mangled-name='wcsrchr' filepath='/usr/include/wchar.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wcsrchr' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/config.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-124' size-in-bits='3968' hash='0b0a2febbc8d1dd0' id='type-id-287'>
      <subrange length='31' lower-bound='0' upper-bound='30' type-id='type-id-58' size-in-bits='64' is-anonymous='yes' hash='a70332a4d2caf54b' id='type-id-288'/>
    </array-type-def>
    <var-decl name='_PyImport_Inittab' type-id='type-id-287' mangled-name='_PyImport_Inittab' visibility='default' filepath='Modules/config.c' line='58' column='1' elf-symbol-id='_PyImport_Inittab'/>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/gcmodule.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <function-decl name='PyInit_gc' mangled-name='PyInit_gc' filepath='Modules/gcmodule.c' line='1545' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyInit_gc' hash='037d575bc520db4e'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyGC_Collect' mangled-name='PyGC_Collect' filepath='Modules/gcmodule.c' line='1584' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyGC_Collect' hash='52c0efb08d2aa513'>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='_PyGC_CollectIfEnabled' mangled-name='_PyGC_CollectIfEnabled' filepath='Modules/gcmodule.c' line='1603' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectIfEnabled' hash='52c0efb08d2aa513'>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='_PyGC_CollectNoFail' mangled-name='_PyGC_CollectNoFail' filepath='Modules/gcmodule.c' line='1612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_CollectNoFail' hash='52c0efb08d2aa513'>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='_PyGC_DumpShutdownStats' mangled-name='_PyGC_DumpShutdownStats' filepath='Modules/gcmodule.c' line='1633' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_DumpShutdownStats' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyGC_Fini' mangled-name='_PyGC_Fini' filepath='Modules/gcmodule.c' line='1669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Fini' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyGC_Dump' mangled-name='_PyGC_Dump' filepath='Modules/gcmodule.c' line='1676' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyGC_Dump' hash='25b31723440b4391'>
      <parameter type-id='type-id-22' name='g' filepath='Modules/gcmodule.c' line='1676' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_Track' mangled-name='PyObject_GC_Track' filepath='Modules/gcmodule.c' line='1690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Track' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_GC_UnTrack' mangled-name='PyObject_GC_UnTrack' filepath='Modules/gcmodule.c' line='1696' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_UnTrack' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Malloc' mangled-name='_PyObject_GC_Malloc' filepath='Modules/gcmodule.c' line='1737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Malloc' hash='7f72d8f75a483747'>
      <parameter type-id='type-id-60' name='basicsize' filepath='Modules/gcmodule.c' line='1743' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Calloc' mangled-name='_PyObject_GC_Calloc' filepath='Modules/gcmodule.c' line='1743' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Calloc' hash='7f72d8f75a483747'>
      <parameter type-id='type-id-60' name='basicsize' filepath='Modules/gcmodule.c' line='1743' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyObject_GC_New' mangled-name='_PyObject_GC_New' filepath='Modules/gcmodule.c' line='1749' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_New' hash='c8726fef827ccf70'>
      <parameter type-id='type-id-289' name='tp' filepath='Modules/gcmodule.c' line='1749' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='_PyObject_GC_NewVar' mangled-name='_PyObject_GC_NewVar' filepath='Modules/gcmodule.c' line='1758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_NewVar' hash='f8a2423ad17e53f6'>
      <parameter type-id='type-id-289' name='tp' filepath='Modules/gcmodule.c' line='1758' column='1'/>
      <parameter type-id='type-id-54' name='nitems' filepath='Modules/gcmodule.c' line='1758' column='1'/>
      <return type-id='type-id-290'/>
    </function-decl>
    <function-decl name='_PyObject_GC_Resize' mangled-name='_PyObject_GC_Resize' filepath='Modules/gcmodule.c' line='1775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_GC_Resize' hash='ebe388a11dc9e6f5'>
      <parameter type-id='type-id-290' name='op' filepath='Modules/gcmodule.c' line='1775' column='1'/>
      <parameter type-id='type-id-54' name='nitems' filepath='Modules/gcmodule.c' line='1775' column='1'/>
      <return type-id='type-id-290'/>
    </function-decl>
    <function-decl name='PyObject_GC_Del' mangled-name='PyObject_GC_Del' filepath='Modules/gcmodule.c' line='1791' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GC_Del' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Modules/main.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' hash='c8355f5d4d517bab' id='type-id-291'/>
    <var-decl name='_PyOS_opterr' type-id='type-id-8' visibility='default' filepath='./Include/pygetopt.h' line='9' column='1'/>
    <var-decl name='_PyOS_optind' type-id='type-id-8' visibility='default' filepath='./Include/pygetopt.h' line='10' column='1'/>
    <var-decl name='_PyOS_optarg' type-id='type-id-246' visibility='default' filepath='./Include/pygetopt.h' line='11' column='1'/>
    <function-decl name='__printf_chk' mangled-name='__printf_chk' filepath='/usr/include/bits/stdio2-decl.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__printf_chk' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setvbuf' mangled-name='setvbuf' filepath='/usr/include/stdio.h' line='337' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setvbuf' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='ungetc' mangled-name='ungetc' filepath='/usr/include/stdio.h' line='726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='ungetc' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='strtok' mangled-name='strtok' filepath='/usr/include/string.h' line='356' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strtok' hash='7f32ffea222edbe7'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='Py_Main' mangled-name='Py_Main' filepath='Modules/main.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_Main' hash='c8f0b503d1c0fefb'>
      <parameter type-id='type-id-8' name='argc' filepath='Modules/main.c' line='360' column='1'/>
      <parameter type-id='type-id-285' name='argv' filepath='Modules/main.c' line='360' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='Py_GetArgcArgv' mangled-name='Py_GetArgcArgv' filepath='Modules/main.c' line='871' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='Py_GetArgcArgv' hash='bda25c1ec5c55712'>
      <parameter type-id='type-id-292' name='argc' filepath='Modules/main.c' line='871' column='1'/>
      <parameter type-id='type-id-291' name='argv' filepath='Modules/main.c' line='871' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='Objects/abstract.c' comp-dir-path='/home/abuild/rpmbuild/BUILD/Python-3.6.15' language='LANG_C99'>
    <class-decl name='_Py_Identifier' is-struct='yes' visibility='default' size-in-bits='192' filepath='./Include/object.h' line='142' column='1' hash='a88b982ada2fe974' id='type-id-293'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='next' type-id='type-id-294' visibility='default' filepath='./Include/object.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='string' type-id='type-id-15' visibility='default' filepath='./Include/object.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='object' type-id='type-id-6' visibility='default' filepath='./Include/object.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='_Py_Identifier' type-id='type-id-293' size-in-bits='192' filepath='./Include/object.h' line='146' column='1' id='type-id-295'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='2225680784ff1271' id='type-id-7'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' hash='0d0e2cd53fadc709' id='type-id-296'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' hash='2dcb3951762e3d89' id='type-id-294'/>
    <pointer-type-def type-id='type-id-295' size-in-bits='64' hash='2dcb3951762e3d89#2' id='type-id-286'/>
    <qualified-type-def type-id='type-id-19' const='yes' hash='351aa155d9983c83' id='type-id-297'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' hash='789df74c745bc4e9' id='type-id-298'/>
    <qualified-type-def type-id='type-id-179' const='yes' hash='4f573491bd5a53e9' id='type-id-299'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' hash='13f8ca305bed7d7b' id='type-id-300'/>
    <qualified-type-def type-id='type-id-54' const='yes' hash='a94911d78f3431fd' id='type-id-301'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' hash='e2a7c3907994fdb5' id='type-id-302'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-303'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' hash='473a9667a2856e32' id='type-id-304'/>
    <function-decl name='PyObject_Type' mangled-name='PyObject_Type' filepath='Objects/abstract.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Type' hash='8759147de6871040'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_Size' mangled-name='PyObject_Size' filepath='Objects/abstract.c' line='45' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Size' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='PyObject_Length' mangled-name='PyObject_Length' filepath='Objects/abstract.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Length' hash='616dbb5e7e171881'>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='_PyObject_HasLen' mangled-name='_PyObject_HasLen' filepath='Objects/abstract.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_PyObject_HasLen' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/fileio.c' line='84' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_LengthHint' mangled-name='PyObject_LengthHint' filepath='Objects/abstract.c' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_LengthHint' hash='654c688c672be4c2'>
      <parameter type-id='type-id-6' name='o' filepath='Objects/abstract.c' line='82' column='1'/>
      <parameter type-id='type-id-54' name='defaultvalue' filepath='Objects/abstract.c' line='82' column='1'/>
      <return type-id='type-id-54'/>
    </function-decl>
    <function-decl name='PyObject_GetItem' mangled-name='PyObject_GetItem' filepath='Objects/abstract.c' line='138' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetItem' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyObject_SetItem' mangled-name='PyObject_SetItem' filepath='Objects/abstract.c' line='170' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_SetItem' hash='63c03439f3e9ae1a'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_DelItem' mangled-name='PyObject_DelItem' filepath='Objects/abstract.c' line='202' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItem' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_DelItemString' mangled-name='PyObject_DelItemString' filepath='Objects/abstract.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_DelItemString' hash='3b98d83926d2d2d8'>
      <parameter type-id='type-id-6' name='o' filepath='Objects/abstract.c' line='2102' column='1'/>
      <parameter type-id='type-id-15' name='key' filepath='Objects/abstract.c' line='2102' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_AsCharBuffer' mangled-name='PyObject_AsCharBuffer' filepath='Objects/abstract.c' line='255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsCharBuffer' hash='580f243fc519f291'>
      <parameter type-id='type-id-6' name='obj' filepath='Objects/abstract.c' line='255' column='1'/>
      <parameter type-id='type-id-303' name='buffer' filepath='Objects/abstract.c' line='256' column='1'/>
      <parameter type-id='type-id-53' name='buffer_len' filepath='Objects/abstract.c' line='257' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_CheckReadBuffer' mangled-name='PyObject_CheckReadBuffer' filepath='Objects/abstract.c' line='263' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CheckReadBuffer' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/fileio.c' line='84' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_AsReadBuffer' mangled-name='PyObject_AsReadBuffer' filepath='Objects/abstract.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsReadBuffer' hash='4e8b341d97851d68'>
      <parameter type-id='type-id-6' name='obj' filepath='Objects/abstract.c' line='298' column='1'/>
      <parameter type-id='type-id-304' name='buffer' filepath='Objects/abstract.c' line='299' column='1'/>
      <parameter type-id='type-id-53' name='buffer_len' filepath='Objects/abstract.c' line='300' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_AsWriteBuffer' mangled-name='PyObject_AsWriteBuffer' filepath='Objects/abstract.c' line='298' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_AsWriteBuffer' hash='4e8b341d97851d68'>
      <parameter type-id='type-id-6' name='obj' filepath='Objects/abstract.c' line='298' column='1'/>
      <parameter type-id='type-id-304' name='buffer' filepath='Objects/abstract.c' line='299' column='1'/>
      <parameter type-id='type-id-53' name='buffer_len' filepath='Objects/abstract.c' line='300' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_GetBuffer' mangled-name='PyObject_GetBuffer' filepath='Objects/abstract.c' line='327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_GetBuffer' hash='c7b354fc0c814775'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_IsContiguous' mangled-name='PyBuffer_IsContiguous' filepath='Objects/abstract.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_IsContiguous' hash='f5271a693a76bf05'>
      <parameter type-id='type-id-300' name='view' filepath='Objects/abstract.c' line='408' column='1'/>
      <parameter type-id='type-id-9' name='order' filepath='Objects/abstract.c' line='408' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_GetPointer' mangled-name='PyBuffer_GetPointer' filepath='Objects/abstract.c' line='424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_GetPointer' hash='2b3d38001d2ea2f4'>
      <parameter type-id='type-id-225' name='view' filepath='Objects/abstract.c' line='424' column='1'/>
      <parameter type-id='type-id-53' name='indices' filepath='Objects/abstract.c' line='424' column='1'/>
      <return type-id='type-id-48'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_F' mangled-name='_Py_add_one_to_index_F' filepath='Objects/abstract.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_F' hash='dd274ad6227d4b2a'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='440' column='1'/>
      <parameter type-id='type-id-53' name='index' filepath='Objects/abstract.c' line='440' column='1'/>
      <parameter type-id='type-id-302' name='shape' filepath='Objects/abstract.c' line='440' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='_Py_add_one_to_index_C' mangled-name='_Py_add_one_to_index_C' filepath='Objects/abstract.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_Py_add_one_to_index_C' hash='dd274ad6227d4b2a'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='440' column='1'/>
      <parameter type-id='type-id-53' name='index' filepath='Objects/abstract.c' line='440' column='1'/>
      <parameter type-id='type-id-302' name='shape' filepath='Objects/abstract.c' line='440' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_FromContiguous' mangled-name='PyBuffer_FromContiguous' filepath='Objects/abstract.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FromContiguous' hash='6beff899f3ff60d5'>
      <parameter type-id='type-id-225' name='view' filepath='Objects/abstract.c' line='472' column='1'/>
      <parameter type-id='type-id-48' name='buf' filepath='Objects/abstract.c' line='472' column='1'/>
      <parameter type-id='type-id-54' name='len' filepath='Objects/abstract.c' line='472' column='1'/>
      <parameter type-id='type-id-9' name='fort' filepath='Objects/abstract.c' line='472' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyObject_CopyData' mangled-name='PyObject_CopyData' filepath='Objects/abstract.c' line='523' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_CopyData' hash='c4e1b837fccfe2d0'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_FillContiguousStrides' mangled-name='PyBuffer_FillContiguousStrides' filepath='Objects/abstract.c' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillContiguousStrides' hash='aef32007a30c6530'>
      <parameter type-id='type-id-8' name='nd' filepath='Objects/abstract.c' line='594' column='1'/>
      <parameter type-id='type-id-53' name='shape' filepath='Objects/abstract.c' line='594' column='1'/>
      <parameter type-id='type-id-53' name='strides' filepath='Objects/abstract.c' line='595' column='1'/>
      <parameter type-id='type-id-8' name='itemsize' filepath='Objects/abstract.c' line='595' column='1'/>
      <parameter type-id='type-id-9' name='fort' filepath='Objects/abstract.c' line='596' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyBuffer_FillInfo' mangled-name='PyBuffer_FillInfo' filepath='Objects/abstract.c' line='618' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_FillInfo' hash='2da70e1c36f66744'>
      <parameter type-id='type-id-225' name='view' filepath='Objects/abstract.c' line='618' column='1'/>
      <parameter type-id='type-id-6' name='obj' filepath='Objects/abstract.c' line='618' column='1'/>
      <parameter type-id='type-id-48' name='buf' filepath='Objects/abstract.c' line='618' column='1'/>
      <parameter type-id='type-id-54' name='len' filepath='Objects/abstract.c' line='618' column='1'/>
      <parameter type-id='type-id-8' name='readonly' filepath='Objects/abstract.c' line='619' column='1'/>
      <parameter type-id='type-id-8' name='flags' filepath='Objects/abstract.c' line='619' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyBuffer_Release' mangled-name='PyBuffer_Release' filepath='Objects/abstract.c' line='657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyBuffer_Release' hash='1a8614bcd1dd8acc'>
      <parameter type-id='type-id-225' name='view' filepath='Objects/abstract.c' line='657' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='PyObject_Format' mangled-name='PyObject_Format' filepath='Objects/abstract.c' line='671' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyObject_Format' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Check' mangled-name='PyNumber_Check' filepath='Objects/abstract.c' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Check' hash='21e5a2f6e2b75eff'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/fileio.c' line='84' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='PyNumber_Or' mangled-name='PyNumber_Or' filepath='Objects/abstract.c' line='919' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Or' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Xor' mangled-name='PyNumber_Xor' filepath='Objects/abstract.c' line='920' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Xor' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_And' mangled-name='PyNumber_And' filepath='Objects/abstract.c' line='921' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_And' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Lshift' mangled-name='PyNumber_Lshift' filepath='Objects/abstract.c' line='922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Lshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Rshift' mangled-name='PyNumber_Rshift' filepath='Objects/abstract.c' line='923' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Rshift' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Subtract' mangled-name='PyNumber_Subtract' filepath='Objects/abstract.c' line='924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Subtract' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Divmod' mangled-name='PyNumber_Divmod' filepath='Objects/abstract.c' line='925' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Divmod' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Add' mangled-name='PyNumber_Add' filepath='Objects/abstract.c' line='928' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Add' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Multiply' mangled-name='PyNumber_Multiply' filepath='Objects/abstract.c' line='959' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Multiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_MatrixMultiply' mangled-name='PyNumber_MatrixMultiply' filepath='Objects/abstract.c' line='978' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_MatrixMultiply' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_FloorDivide' mangled-name='PyNumber_FloorDivide' filepath='Objects/abstract.c' line='984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_FloorDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_TrueDivide' mangled-name='PyNumber_TrueDivide' filepath='Objects/abstract.c' line='990' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_TrueDivide' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Remainder' mangled-name='PyNumber_Remainder' filepath='Objects/abstract.c' line='996' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Remainder' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_Power' mangled-name='PyNumber_Power' filepath='Objects/abstract.c' line='1002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_Power' hash='a8fa4819a02c2400'>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-6'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceOr' mangled-name='PyNumber_InPlaceOr' filepath='Objects/abstract.c' line='1058' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceOr' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceXor' mangled-name='PyNumber_InPlaceXor' filepath='Objects/abstract.c' line='1059' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceXor' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='PyNumber_InPlaceAnd' mangled-name='PyNumber_InPlaceAnd' filepath='Objects/abstract.c' line='1060' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='PyNumber_InPlaceAnd' hash='2e839175b6f0d64e'>
      <parameter type-id='type-id-6' name='self' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <parameter type-id='type-id-6' name='args' filepath='./Modules/_io/iobase.c' line='420' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
